{
  "day": 5,
  "date": "2025-12-05",
  "dateDisplay": "December 5, 2025",
  "title": "Radius operator: scales as geometric invariants",
  "subtitle": "From (α,β,γ) to (a₀,b₀,c₀) and energy hierarchies",
  "keyInsight": "The radius operator R extracts three characteristic length scales (a₀,b₀,c₀) from the heptagon structure. Exponentials of these scales serve as prototypes for the Planck, electroweak and QCD scales. For the first time, fundamental energy hierarchies emerge as geometric invariants, not input parameters.",
  "content": "<h3>From directions to radii</h3>\n<p>Yesterday's heptagon operator $H_7$ compressed the seven\nimaginary directions of the octonions into three eigenvalues\n$(\\alpha,\\beta,\\gamma)$. Today we take the next step: we pass from\n<em>angular</em> information to <em>radial</em> information.</p><p>Intuitively:</p><ul>\n  <li>$H_7$ encodes how the seven directions are oriented relative to\n        each other.\n  <li>The radius operator $R$ encodes how far typical internal\n        configurations lie from certain preferred centres in this\n        7-dimensional structure.\n</ul><p>The precise construction of $R$ is technical, but its qualitative role is\nsimple: it measures distance in the internal symmetry atlas defined by the\nheptagon and $G_2$.</p>\n<h3>Defining the radius operator $R$</h3>\n<p>In the internal 8-dimensional space, one can construct an operator $R$\nwhose definition is constrained by:</p><ul>\n  <li>$G_2$-invariance (it must respect the octonionic automorphisms),\n  <li>compatibility with the heptagon structure,\n  <li>positivity or at least a well-defined spectrum that can be\n        interpreted as squared radii.\n</ul><p>Schematically, one may think of $R$ as a function of the heptagon\noperator and related data:</p><p>\\[\n  R = F(H_7),\n\\]</p><p>where $F$ is chosen such that $R$ has only three distinct eigenvalues:</p><p>\\[\n  \\mathrm{spec}(R) = \\{a_0, b_0, c_0\\},\n\\]</p><p>with multiplicities adding up to 8. The triple</p><p>\\[\n  (a_0,b_0,c_0)\n\\]</p><p>is then the <em>radius spectrum</em>: three characteristic internal radii\nassociated with the geometry encoded by the heptagon.</p>\n<h3>From radii to energy scales</h3>\n<p>In quantum field theory, length scales and energy scales are inversely\nrelated. It is therefore natural to turn dimensionless radii into\ndimensionless energy scales by exponentiation:</p><p>\\[\n  \\Lambda_i \\;\\sim\\; \\exp(a_0),\\quad\n  \\Lambda_j \\;\\sim\\; \\exp(b_0),\\quad\n  \\Lambda_k \\;\\sim\\; \\exp(c_0),\n\\]</p><p>up to overall normalisations. With a suitable choice of units, one can\nassociate:</p><ul>\n  <li>one radius with the <em>Planck scale</em>,\n  <li>one with the <em>electroweak scale</em>,\n  <li>one with the <em>QCD/confinement scale</em>.\n</ul><p>The key message is not the exact fit (that requires detailed numerics)\nbut the <em>structural fact</em>:</p><p>quote\n  There exist three distinguished internal radii $(a_0,b_0,c_0)$ from\n  which three physically relevant energy scales can naturally be\n  constructed.\nquote</p>\n<h3>Why three scales?</h3>\n<p>Empirically, particle physics is organised around three strikingly\ndifferent characteristic scales:</p><ol>\n  <li>The Planck scale, where gravity becomes comparable to other\n        interactions.\n  <li>The electroweak scale, where $SU(2)_L \\times U(1)_Y$ symmetry is\n        broken.\n  <li>The QCD scale, where confinement and chiral symmetry breaking\n        dominate.\n</ol><p>In the model, this triad is mirrored by the triad $(a_0,b_0,c_0)$:</p><ul>\n  <li>The number of qualitatively distinct scales is fixed by the\n        structure of $R$, not by phenomenological needs.\n  <li>The relative ordering and separation of these scales can be traced\n        back to differences between $a_0$, $b_0$ and $c_0$.\n</ul><p>This turns a long-standing \"why these three?\" question into a statement\nabout the eigenstructure of an internal operator.</p>\n<h3>Radius operator within the attractor picture</h3>\n<p>On the second Advent Sunday (7 December), the calendar will present the\nidea of an <em>attractor</em> for scales. In that picture:</p><ul>\n  <li>The triple $(a_0,b_0,c_0)$ defines three preferred radii in the\n        internal space.\n  <li>Renormalisation-group (RG) flow in the physical theory is naturally\n        attracted to energy values constructed from these radii.\n  <li>The observed scales are stable fixed points rather than arbitrary\n        initial conditions.\n</ul><p>The radius operator $R$ is thus the internal, geometric backbone of this\nattractor story. Without $R$ and its discrete spectrum, the attractor\nmechanism would have nothing to lock onto.</p>\n<h3>Conceptual gain from $spec</h3>\n<p>(R)=(a_0,b_0,c_0)$</p><p>Introducing $R$ and its spectrum brings several conceptual benefits:</p><ol>\n  <li><strong>Geometric origin of hierarchies:</strong>\n    large ratios between energy scales (Planck vs.\\ electroweak vs.\\ QCD)\n    are no longer mere accidents but are linked to differences between\n    eigenvalues of a symmetry-constrained operator.\n  <li><strong>Minimality:</strong>\n    three radii suffice—no large list of independent scale parameters is\n    needed at the fundamental level.\n  <li><strong>Spectral language:</strong>\n    scale information is encoded spectrally, aligning with the later use\n    of spectral geometry and spectral actions.\n</ol><p>This is why the XLS lists the radius operator as the first explicit bridge\nfrom abstract octonionic geometry to physically observed hierarchies.</p><p>ChamseddineConnes<p><strong>Marcolli2007</strong><br>\nA.~H.~Chamseddine, A.~Connes and M.~Marcolli,\n\"Gravity and the standard model with neutrino mixing,\"\nAdv.\\ Theor.\\ Math.\\ Phys. <strong>11</strong>, 991--1089 (2007).</p><p><p><strong>Wilson1971</strong><br>\nK.~G.~Wilson,\n\"Renormalization group and critical phenomena,\"\nPhys.\\ Rev.\\ B <strong>4</strong>, 3174--3183 (1971).</p><p>Internal\n[Internal notes on the radius operator and scale hierarchies:\nchap03\\_neu.tex; appK\\_neu.tex; konstanten-hierarchie.tex.]</p>",
  "closing": "The radius operator $R$ translates the heptagon geometry into three\n   characteristic radii $(a_0,b_0,c_0)$. Exponentials of these radii\n   provide natural candidates for the Planck, electroweak and QCD scales,\n   turning energy hierarchies into geometric invariants rather than\n   arbitrary inputs.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "R: Spec(R)=(a₀,b₀,c₀); Skalen ∼ exp(a₀), exp(b₀), exp(c₀)",
  "dependencies": "Erste Brücke von abstrakter Algebra zu beobachtbaren Energieskalen.",
  "isLocked": true,
  "references": [
    {
      "key": "ChamseddineConnesMarcolli2007",
      "text": "A. H. Chamseddine, A. Connes and M. Marcolli, ``Gravity and the standard model with neutrino mixing,'' Adv. Theor. Math. Phys. <strong>11</strong>, 991--1089 (2007)."
    },
    {
      "key": "Wilson1971",
      "text": "K. G. Wilson, ``Renormalization group and critical phenomena,'' Phys. Rev. B <strong>4</strong>, 3174--3183 (1971)."
    },
    {
      "key": "Internal",
      "text": "[Internal notes on the radius operator and scale hierarchies: chap03_neu.tex; appK_neu.tex; konstanten-hierarchie.tex.] thebibliography"
    }
  ],
  "intro": "<p>Yesterday's heptagon operator $H_7$ compressed the seven imaginary directions of the octonions into three eigenvalues $(\\alpha,\\beta,\\gamma)$, capturing angular information about how these directions are oriented relative to each other. Today we take the next step: we pass from angular information to radial information. The <em>radius operator</em> $R$ measures distance in the internal symmetry atlas defined by the heptagon and $G_2$.</p>\n\n<p>The radius operator is constructed from the heptagon geometry and the octonionic structure, constrained by $G_2$-invariance and compatibility with the heptagon. Its spectrum is again remarkably simple:\n\\[\n  \\mathrm{spec}(R) = \\{a_0, b_0, c_0\\},\n\\]\nthree characteristic dimensionless radii with multiplicities adding up to 8. The triple $(a_0,b_0,c_0)$ is the <em>radius spectrum</em>: three internal radii associated with the geometry encoded by the heptagon.</p>\n\n<p>Why does this matter? Because in quantum field theory, length scales and energy scales are inversely related. It is therefore natural to turn dimensionless radii into dimensionless energy scales by exponentiation:\n\\[\n  \\Lambda_i \\;\\sim\\; \\exp(a_0),\\quad\n  \\Lambda_j \\;\\sim\\; \\exp(b_0),\\quad\n  \\Lambda_k \\;\\sim\\; \\exp(c_0),\n\\]\nup to overall normalisations. With a suitable choice of units, one can associate one radius with the Planck scale, one with the electroweak scale, and one with the QCD/confinement scale.</p>\n\n<p>The key message is not the exact fit—that requires detailed numerics—but the <em>structural fact</em>: there exist three distinguished internal radii $(a_0,b_0,c_0)$ from which three physically relevant energy scales can naturally be constructed. For the first time, fundamental energy hierarchies appear as <em>geometric invariants</em> of an internal operator, not as arbitrary input parameters.</p>\n\n<p>Empirically, particle physics is organised around three strikingly different characteristic scales: the Planck scale, where gravity becomes comparable to other interactions; the electroweak scale, where $SU(2)_L \\times U(1)_Y$ symmetry is broken; and the QCD scale, where confinement and chiral symmetry breaking dominate. In the model, this triad is mirrored by the triad $(a_0,b_0,c_0)$: the number of qualitatively distinct scales is fixed by the structure of $R$, not by phenomenological needs. The relative ordering and separation of these scales can be traced back to differences between $a_0$, $b_0$ and $c_0$. This turns a long-standing \"why these three?\" question into a statement about the eigenstructure of an internal operator.</p>\n\n<p>On the second Advent Sunday (7 December), the calendar will present the idea of an <em>attractor</em> for scales. In that picture, the triple $(a_0,b_0,c_0)$ defines three preferred radii in the internal space, and renormalisation-group (RG) flow in the physical theory is naturally attracted to energy values constructed from these radii. The observed scales are stable fixed points rather than arbitrary initial conditions. The radius operator $R$ is thus the internal, geometric backbone of this attractor story. Without $R$ and its discrete spectrum, the attractor mechanism would have nothing to lock onto.</p>\n\n<p>Introducing $R$ and its spectrum brings several conceptual benefits:</p>\n\n<ol>\n  <li><strong>Geometric origin of hierarchies:</strong> large ratios between energy scales (Planck vs. electroweak vs. QCD) are no longer mere accidents but are linked to differences between eigenvalues of a symmetry-constrained operator.</li>\n  <li><strong>Minimality:</strong> three radii suffice—no large list of independent scale parameters is needed at the fundamental level.</li>\n  <li><strong>Spectral language:</strong> scale information is encoded spectrally, aligning with the later use of spectral geometry and spectral actions.</li>\n</ol>\n\n<p>This is why the radius operator is the first explicit bridge from abstract octonionic geometry to physically observed hierarchies. It turns the question \"Why are there three widely separated scales?\" into \"What is the spectrum of the radius operator?\"—a question that can, in principle, be answered by solving an eigenvalue problem constrained by $G_2$ symmetry.</p>"
}