{
  "day": 4,
  "date": "2025-12-04",
  "dateDisplay": "December 4, 2025",
  "title": "Heptagon operator: seven directions, one spectrum",
  "subtitle": "From seven imaginary units to three eigenvalues ($\\alpha_1, \\alpha_2, \\alpha_3$)",
  "keyInsight": "The seven imaginary octonion units can be arranged on a heptagon that encodes their multiplication rules. From this geometry one extracts three special numbers: the \\emph{heptagon eigenvalues} $(\\alpha_1,\\alpha_2,\\alpha_3)$. They arise as ratios of heptagon diagonals, satisfy a simple cubic equation, and are completely fixed by the shape of the regular heptagon. Later they will be used as the spectrum of a heptagon operator that feeds into coupling constants and mixing angles. Today we introduce these three numbers as a compact fingerprint of the sevenfold structure of $\\mathbb{O}$.",
  "content": "<h3>Seven imaginary units on a heptagon</h3><p>Octonions &lt;&lt;&lt;MATH0&gt;&gt;&gt; have seven imaginary units &lt;&lt;&lt;MATH1&gt;&gt;&gt;. Their multiplication can be depicted on an oriented heptagon: each directed edge (and certain chords) carries a triple &lt;&lt;&lt;MATH2&gt;&gt;&gt; with &lt;&lt;&lt;MATH21&gt;&gt;&gt; and reversed order introduces a minus sign. This Fano-type diagram is more than a mnemonic; it packages the nonassociative multiplication table into a single geometric picture.</p><h3>Heptagon geometry and diagonal ratios</h3><p>A regular heptagon has not only seven vertices, but also several types of diagonals. If we fix its circumradius, then all edge lengths and diagonal lengths are pure shape data. In particular, there are three distinguished diagonal lengths, which we call &lt;&lt;&lt;MATH3&gt;&gt;&gt; like the French &lt;em&gt;un, deux, trois&lt;/em&gt;. Starting at one vertex, we walk one, two, three vertices along the heptagon and eventually connect start and end point. %&lt;&lt;&lt;MATH22&gt;&gt;&gt; From them we form three dimensionless ratios: &lt;&lt;&lt;MATH23&gt;&gt;&gt; They fulfill the elementary symmetric functions &lt;&lt;&lt;MATH24&gt;&gt;&gt; so the triple &lt;&lt;&lt;MATH4&gt;&gt;&gt; is not arbitrary. These three numbers are completely fixed by the shape of the regular heptagon. They satisfy a simple cubic equation, &lt;&lt;&lt;MATH25&gt;&gt;&gt; and its three real roots are exactly &lt;&lt;&lt;MATH5&gt;&gt;&gt;.</p><p>In other words: the combinatorial data \"seven vertices with their diagonals\" collapses to three pure shape invariants. They are the &lt;em&gt;heptagon eigenvalues&lt;/em&gt; in geometric form.</p><h3>From seven directions to three modes</h3><p>The imaginary octonions span a seven-dimensional space. Each imaginary unit corresponds to a vertex of the heptagon. At first sight, one might think that all seven directions are independent.</p><p>The heptagon geometry, however, tells us that there is a simpler description. When we look at patterns that respect the cyclic symmetry of the heptagon, seven directions naturally fall into three symmetry-adapted \"modes\". Exactly these three modes are quantified by the heptagon ratios &lt;&lt;&lt;MATH6&gt;&gt;&gt;: they are the three characteristic values of how such a symmetry-adapted pattern \"spreads out\" along the heptagon.</p><p>In more technical language, one can construct an octonionic linear operator whose action on these three modes is diagonal with eigenvalues &lt;&lt;&lt;MATH7&gt;&gt;&gt;. The detailed construction is deferred to the main text; what matters here is the conceptual picture: a seven-dimensional internal space is encoded by three heptagon eigenvalues.</p><h3>Why $(\\alpha_1,\\alpha_2,\\alpha_3)$ matter for physics</h3><p>Later in the calendar, &lt;&lt;&lt;MATH9&gt;&gt;&gt; will reappear in several contexts:</p><ul><li>In the construction of the <em>radius operator</em> $R$ and its spectrum $(a_0,b_0,c_0)$ (tomorrow). <li>In geometric expressions for coupling constants, such as the fine-structure constant $\\alpha$ and the strong coupling $\\alpha_s$. <li>In defining angles between rotor directions that enter the Weinberg angle $\\theta_W$. </ul><p>In other words, the heptagon eigenvalues are a compact &lt;em&gt;seed&lt;/em&gt; from which many later observables can be grown. They serve as a small set of internal numbers that eventually manifest as physical constants.</p><h3>Heptagon spectrum within the operator toolbox</h3><p>On the second Advent Sunday (7 December), the calendar will present a full &lt;em&gt;operator toolbox&lt;/em&gt;:</p><ul><li>heptagon operator with eigenvalues $(\\alpha_1,\\alpha_2,\\alpha_3)$, <li>radius operator $R$ with radii $(a_0,b_0,c_0)$, <li>sign/signature operators, <li>rotors (antisymmetric generators of forces), <li>compressors (symmetric mass and mixing operators). </ul><p>The heptagon data are the first piece of this toolbox to appear explicitly. Their role is to turn the combinatorial data \"seven imaginary units on a heptagon\" into spectral data that can be plugged into operators, potentials and eventually quantitative formulas.</p><h3>Conceptual gain from the heptagon eigenvalues</h3><p>Compared to working directly with seven basis elements &lt;&lt;&lt;MATH18&gt;&gt;&gt;, the heptagon-eigenvalue viewpoint offers:</p><ol><li><strong>Compression:</strong> seven directions are summarised by three eigenvalues. <li><strong>Invariants:</strong> $(\\alpha_1,\\alpha_2,\\alpha_3)$ are invariant under heptagon symmetries and $G_2$-compatible re-labellings—they are not artefacts of a particular basis choice. <li><strong>Spectral language:</strong> we move from basis-dependent multiplication tables to basis-independent spectral data, which is the natural language for later spectral geometry. </ol><p>Thus, the heptagon eigenvalues are the first place where the octonionic multiplication table starts to look like something a physicist would recognise as \"spectral parameters\".</p><p>\\small \\begin{}{9}</p><p>\\bibitem{Baez2002} J.~C.~Baez, \"The octonions,\" {\\em Bull.\\ Amer.\\ Math.\\ Soc.} &lt;strong&gt;39&lt;/strong&gt;, 145--205 (2002).</p><p>\\bibitem{deCasteljau1987} P.~de Casteljau, {\\em Les Quaternions}, Paris: Hermès, 1987.</p><p>\\bibitem{Furey2016} C.~Furey, \"Charge quantization from a number operator,\" {\\em Phys.\\ Lett.\\ B} &lt;strong&gt;742&lt;/strong&gt;, 195--199 (2015).</p><p>\\end{} \\normalsize</p>",
  "closing": "The heptagon eigenvalues $(\\alpha_1,\\alpha_2,\\alpha_3)$ compress the seven imaginary directions of $\\mathbb{O}$ into three geometric invariants. These numbers will later reappear in couplings, scales and mixing angles.",
  "type": "standard",
  "special": "",
  "centralFormula": "",
  "dependencies": [],
  "isLocked": false,
  "references": [
    {
      "key": "Baez2002",
      "text": "<p>J.~C.~Baez, ``The octonions,'' {\\em Bull.\\ Amer.\\ Math.\\ Soc.} &lt;strong&gt;39&lt;/strong&gt;, 145--205 (2002).</p>"
    },
    {
      "key": "deCasteljau1987",
      "text": "<p>P.~de Casteljau, {\\em Les Quaternions}, Paris: Hermès, 1987.</p>"
    },
    {
      "key": "Furey2016",
      "text": "<p>C.~Furey, ``Charge quantization from a number operator,'' {\\em Phys.\\ Lett.\\ B} &lt;strong&gt;742&lt;/strong&gt;, 195--199 (2015).</p>"
    }
  ],
  "intro": "<p>% #6 body (two columns)</p><p>The octonions have seven imaginary units, and their multiplication rules can be visualised on an oriented heptagon — a Fano-type diagram that packages the entire nonassociative multiplication table into a single geometric picture. Hidden in this heptagon there is a simpler description: instead of seven separate directions, we can summarise the internal geometry by just three distinguished numbers.</p><p>These three numbers will later appear as the eigenvalues of a &lt;em&gt;heptagon operator&lt;/em&gt;: an octonionic linear operator whose action on a suitable three-dimensional subspace is completely described by that spectrum. For the Advent calendar, we do not need the full operator construction. What matters is that the heptagon geometry singles out a triple &lt;&lt;&lt;MATH0&gt;&gt;&gt; that already encodes the essential shape data.</p><p>Why does this matter? Because &lt;&lt;&lt;MATH1&gt;&gt;&gt; will reappear throughout the calendar: in the construction of the radius operator &lt;&lt;&lt;MATH2&gt;&gt;&gt; and its spectrum &lt;&lt;&lt;MATH3&gt;&gt;&gt; (5 December), in geometric expressions for coupling constants such as the fine-structure constant &lt;&lt;&lt;MATH4&gt;&gt;&gt; and the strong coupling &lt;&lt;&lt;MATH5&gt;&gt;&gt;, and in defining angles between rotor directions that enter the Weinberg angle &lt;&lt;&lt;MATH6&gt;&gt;&gt;. The heptagon eigenvalues are a compact &lt;em&gt;seed&lt;/em&gt; from which many later observables can be grown.</p><p>Conceptually, this marks the transition from combinatorial data — \"seven imaginary units on a heptagon\" — to spectral data that can be plugged into operators, potentials and eventually quantitative formulas. The heptagon eigenvalues are the first piece of the operator toolbox that will be fully assembled on the second Advent Sunday (7 December), alongside the radius operator, rotors, compressors and sign operators.</p><p>The heptagon spectrum thus serves three roles at once:</p><ol><li><strong>Compression:</strong> seven directions are summarised by three eigenvalues. <li><strong>Invariance:</strong> $(\\alpha_1,\\alpha_2,\\alpha_3)$ are invariant under heptagon symmetries and $G_2$-compatible re-labellings—they are not artefacts of a particular basis choice. <li><strong>Spectral language:</strong> we move from basis-dependent multiplication tables to basis-independent spectral data, which is the natural language for later spectral geometry. </ol><p>In short, the heptagon eigenvalues are the first place where the octonionic multiplication table starts to look like something a physicist would recognise as \"spectral parameters\". They turn abstract algebra into a small set of internal numbers that eventually manifest as physical constants.</p>"
}