{
  "day": 19,
  "date": "2025-12-20",
  "dateDisplay": "December 20, 2025",
  "title": "Dark matter as a shadow sector of compressors",
  "subtitle": "Why nature 'chooses' exactly three stable scales",
  "keyInsight": "The three fundamental scales (Planck, electroweak, QCD) are not input parameters but fixed points of an attractor mechanism in the radius spectrum (a₀,b₀,c₀). Renormalisation-group flow drives the system toward these fixed points. Nature 'chooses' these scales because they are stable under perturbations—they are inevitable, not accidental.",
  "content": "<h3>From radius spectrum to preferred scales</h3>\n<p>Earlier in the calendar, the radius operator $R$ was\nintroduced with spectrum</p><p>\\[\n  \\mathrm{spec}(R) = (a_0,b_0,c_0).\n\\]</p><p>Exponentials of these radii define three candidate scales,</p><p>\\[\n  \\Lambda_i \\sim e^{a_0},\\quad\n  \\Lambda_j \\sim e^{b_0},\\quad\n  \\Lambda_k \\sim e^{c_0},\n\\]</p><p>which were associated with the Planck, electroweak and QCD scales. So far\nthis was a geometric correspondence. Today we add dynamics: these scales\nare not only present in the geometry, they are <em>dynamically\nselected</em> by RG flow.</p>\n<h3>RG flow and attractors</h3>\n<p>In Wilsonian renormalisation, a theory is described by a point in the\nspace of couplings. Changing the energy scale $\\mu$ corresponds to moving\nalong a trajectory governed by $\\beta$-functions,</p><p>\\[\n  \\frac{d g_i}{d\\ln\\mu} = \\beta_i(\\{g\\}).\n\\]</p><p>Fixed points are defined by $\\beta_i(\\{g^\\ast\\})=0$ and play a central role:</p><ul>\n  <li>UV fixed points control short-distance behaviour.\n  <li>IR fixed points control long-distance behaviour.\n  <li>Some fixed points are <em>attractors</em>: generic RG trajectories\n        are drawn towards them.\n</ul><p>In the octonionic model, the radius spectrum $(a_0,b_0,c_0)$ enters the\n$\\beta$-functions in a structured way, so that three distinguished\nenergies become attractor scales.</p>\n<h3>Qualitative picture of the attractor mechanism</h3>\n<p>Heuristically, one finds:</p><ul>\n  <li>When $\\mu$ is near $e^{a_0}$, RG flow of certain couplings slows\n        down and stabilises; this defines a Planck-like scale.\n  <li>Near $e^{b_0}$, electroweak couplings and masses experience a\n        similar slowdown and stabilisation.\n  <li>Near $e^{c_0}$, the strong coupling crosses order one and the\n        theory flows towards a confined regime.\n</ul><p>The detailed form of $\\beta$-functions is model-dependent, but the\nlocation and number of attractor scales are dictated by $(a_0,b_0,c_0)$.\nArbitrary additional scales cannot be introduced without spoiling this\nstructure.</p>\n<h3>Stability instead of fine-tuning</h3>\n<p>Traditional fine-tuning problems (``Why is the electroweak scale so small\ncompared to the Planck scale?'') are rephrased:</p><p>quote\n  Why are there stable RG attractors at such widely separated scales?\nquote</p><p>The model answers:</p><ul>\n  <li>Because $(a_0,b_0,c_0)$ are widely separated eigenvalues of $R$.\n  <li>Because RG flow is structured in such a way that these eigenvalues\n        generate stable fixed points.\n</ul><p>The hierarchy is no longer a coincidence between unrelated parameters but\na built-in feature of the internal operator spectrum.</p>\n<h3>Conceptual and phenomenological implications</h3>\n<p>Conceptually:</p><ol>\n  <li><strong>Fewer inputs:</strong>\n    instead of three independent scale parameters, one internal operator\n    with three eigenvalues suffices.\n  <li><strong>Dynamical selection:</strong>\n    scales are not only present in the geometry but are dynamically\n    attractive under RG flow.\n  <li><strong>Predictive structure:</strong>\n    any attempt to introduce new fundamental scales must explain how they\n    fit into, or modify, the attractor pattern.\n</ol><p>Phenomenologically:</p><ul>\n  <li>Small variations in UV initial conditions do not destroy the\n        large-scale structure: the flow is drawn back to the attractors.\n  <li>This robustness is precisely what one expects from a realistic\n        description of the universe: observed scales should not be\n        hypersensitive to microscopic details.\n</ul><p><p><strong>Wilson1971</strong><br>\nK.~G.~Wilson,\n\"Renormalization group and critical phenomena,\"\nPhys.\\ Rev.\\ B <strong>4</strong>, 3174--3183 (1971).</p><p><p><strong>Wetterich1988</strong><br>\nC.~Wetterich,\n\"Cosmology and the fate of dilatation symmetry,\"\nNucl.\\ Phys.\\ B <strong>302</strong>, 668--696 (1988).</p><p>Internal\n[Internal notes on scale hierarchies and attractor mechanisms:\nchap16A\\_neu.tex; appK\\_neu.tex; konstanten-hierarchie.tex.]</p>",
  "closing": "The triple $(a_0,b_0,c_0)$ of radius eigenvalues does not only suggest\n   three important scales; it also defines RG attractors. Planck,\n   electroweak and QCD scales are dynamically preferred fixed points,\n   not arbitrary external inputs.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "Skalen = Attractor(a₀,b₀,c₀); RG-Flow → Fixpunkte",
  "dependencies": "Erklärt, warum die Natur genau diese Skalen 'wählt' – sie sind stabil unter Störungen.",
  "isLocked": true,
  "references": [
    {
      "key": "Wilson1971",
      "text": "K. G. Wilson, ``Renormalization group and critical phenomena,'' Phys. Rev. B <strong>4</strong>, 3174--3183 (1971)."
    },
    {
      "key": "Wetterich1988",
      "text": "C. Wetterich, ``Cosmology and the fate of dilatation symmetry,'' Nucl. Phys. B <strong>302</strong>, 668--696 (1988)."
    },
    {
      "key": "Internal",
      "text": "[Internal notes on scale hierarchies and attractor mechanisms: chap16A_neu.tex; appK_neu.tex; konstanten-hierarchie.tex.] thebibliography"
    }
  ],
  "intro": "<p>The three fundamental scales (Planck, electroweak, QCD) are not arbitrary inputs but fixed points of an attractor mechanism linked to the radius spectrum (a₀,b₀,c₀). Renormalisation-group (RG) flow drives couplings and masses towards these scales, which are stable under perturbations. Nature 'chooses' them because they are dynamically preferred, not because they were inserted by hand.</p>\n\n<p>Earlier in the calendar, the radius operator R was introduced with spectrum</p>\n\n<p>spec(R) = (a₀,b₀,c₀).</p>\n\n<p>Exponentials of these radii define three candidate scales,</p>\n\n<p>Λᵢ ~ e^(a₀), Λⱼ ~ e^(b₀), Λₖ ~ e^(c₀),</p>\n\n<p>which were associated with the Planck, electroweak and QCD scales. So far this was a geometric correspondence. Today we add dynamics: these scales are not only present in the geometry, they are dynamically selected by RG flow.</p>\n\n<p>In Wilsonian renormalisation, a theory is described by a point in the space of couplings. Changing the energy scale μ corresponds to moving along a trajectory governed by β-functions,</p>\n\n<p>dgᵢ/d ln μ = βᵢ({g}).</p>\n\n<p>Fixed points are defined by βᵢ({g*})=0 and play a central role: UV fixed points control short-distance behaviour, IR fixed points control long-distance behaviour, and some fixed points are attractors: generic RG trajectories are drawn towards them.</p>\n\n<p>In the octonionic model, the radius spectrum (a₀,b₀,c₀) enters the β-functions in a structured way, so that three distinguished energies become attractor scales.</p>\n\n<p>Heuristically, one finds: when μ is near e^(a₀), RG flow of certain couplings slows down and stabilises; this defines a Planck-like scale. Near e^(b₀), electroweak couplings and masses experience a similar slowdown and stabilisation. Near e^(c₀), the strong coupling crosses order one and the theory flows towards a confined regime.</p>\n\n<p>The detailed form of β-functions is model-dependent, but the location and number of attractor scales are dictated by (a₀,b₀,c₀). Arbitrary additional scales cannot be introduced without spoiling this structure.</p>\n\n<p>Traditional fine-tuning problems ('Why is the electroweak scale so small compared to the Planck scale?') are rephrased: Why are there stable RG attractors at such widely separated scales?</p>\n\n<p>The model answers: because (a₀,b₀,c₀) are widely separated eigenvalues of R, and because RG flow is structured in such a way that these eigenvalues generate stable fixed points.</p>\n\n<p>The hierarchy is no longer a coincidence between unrelated parameters but a built-in feature of the internal operator spectrum.</p>\n\n<p>Conceptually: instead of three independent scale parameters, one internal operator with three eigenvalues suffices. Scales are not only present in the geometry but are dynamically attractive under RG flow. Any attempt to introduce new fundamental scales must explain how they fit into, or modify, the attractor pattern.</p>\n\n<p>Phenomenologically: small variations in UV initial conditions do not destroy the large-scale structure: the flow is drawn back to the attractors. This robustness is precisely what one expects from a realistic description of the universe: observed scales should not be hypersensitive to microscopic details.</p>\n\n<p>The triple (a₀,b₀,c₀) of radius eigenvalues does not only suggest three important scales; it also defines RG attractors. Planck, electroweak and QCD scales are dynamically preferred fixed points, not arbitrary external inputs.</p>"
}