{
  "day": 14,
  "date": "2025-12-14",
  "dateDisplay": "December 14, 2025",
  "title": "CKM and PMNS",
  "subtitle": "Mixing matrices as transition charts on H₃(𝕆)",
  "keyInsight": "The mass matrix arises as a linear image of a Jordan element H∈H₃(O) via the map Π:H₃(O)→End(ℝ⁸). Mass spectra depend on Jordan invariants, not on freely chosen parameters. Flavor mixings (CKM, PMNS) result from eigenvectors of specific compressors; mixing angles are constrained by the internal octonionic structure. Mass hierarchies and flavor physics are two faces of the same geometric coin.",
  "content": "<h3>Two mysterious unitary matrices</h3>\n<p>The Standard Model describes quark and lepton mixings by\ntwo unitary matrices:\n\\[\n  V_{\\text{CKM}} \\quad\\text{for quarks},\\qquad\n  U_{\\text{PMNS}} \\quad\\text{for leptons}.\n\\]\nEmpirically, $V_{\\text{CKM}}$ is close to the identity with small off-diagonal\nelements, while $U_{\\text{PMNS}}$ shows large mixings between neutrino\nflavors. In the usual formulation, both matrices are introduced by hand\nwhen diagonalising Yukawa matrices. They are indispensable in\nphenomenology, but their structure appears accidental.</p><p>The octonionic model offers a different viewpoint. It treats mixing angles\nand phases not as arbitrary complex numbers, but as geometric data attached\nto how different preferred bases in the exceptional internal space\nintersect.</p>\n<h3>The internal atlas picture</h3>\n<p>The internal degrees of freedom live in the Albert algebra $H_3(\\mathbb{O})$,\nwith automorphism group $F_4$. On this space, several distinguished\noperators are defined:</p><ul>\n  <li>The <em>mass map</em> $\\Pi(H)$, built from a vacuum configuration\n        $\\langle H\\rangle$, whose eigenvectors encode mass eigenstates.\n  <li><em>Flavor projectors</em> which single out quark-like and\n        lepton-like subspaces.\n  <li><em>Compressor</em> and <em>rotor</em> operators that encode hierarchies\n        and couplings.\n</ul><p>Different physical questions prefer different eigenbases:</p><ul>\n  <li>Gauge interactions \"see\" eigenbases aligned with flavor projectors.\n  <li>Mass measurements \"see\" eigenbases of $\\Pi(H)$.\n</ul><p>The resulting misalignment between these bases is what phenomenologists\ncall \"mixing\". In the geometric language, it is nothing but a transition\nmap between charts on the internal space.</p>\n<h3>CKM as a transition map in the quark sector</h3>\n<p>Focus first on the quark sector. Consider two orthonormal bases of the\nrelevant internal subspace:</p><ul>\n  <li>$\\{\\,d_i\\,\\}$, $i=1,2,3$, adapted to flavor (interaction)\n        eigenstates: these diagonalise the couplings to $W^\\pm$ and gluons.\n  <li>$\\{\\,d_i'\\,\\}$, $i=1,2,3$, adapted to mass eigenstates:\n        these diagonalise the restriction of $\\Pi(H)$ to the down-type quark\n        sector.\n</ul><p>By definition, there exists a unitary matrix $V_{\\text{CKM}}$ such that\n\\[\n  d_i\\;=\\; \\sum_j (V_{\\text{CKM}})_{ij}\\,d_j'.\n\\]\nIn the octonionic setting, both bases arise from eigenproblems for\noperators that live in the same exceptional algebra and are constrained by\nits structure. As a result:</p><ul>\n  <li>The allowed pattern of overlaps $(V_{\\text{CKM}})_{ij}$ is not\n        arbitrary; some entries are naturally suppressed or enhanced.\n  <li>Small quark mixing angles become a consequence of how the quark\n        flavor projectors and the mass map almost commute within the\n        relevant subspace of $H_3(\\mathbb{O})$.\n</ul><p>The hierarchical structure of $V_{\\text{CKM}}$ thus reflects an almost\ncompatible choice of charts in the internal atlas.</p>\n<h3>PMNS and the special role of neutrinos</h3>\n<p>For leptons, the situation is different. The PMNS matrix connects charged\nlepton mass eigenstates to neutrino flavor eigenstates. In many models,\nneutrinos are Majorana particles with a mass matrix that has a different\norigin from the charged lepton masses.</p><p>In the octonionic model, this difference is encoded in the way neutrino\ndirections sit inside $H_3(\\mathbb{O})$:</p><ul>\n  <li>Neutrino-like internal directions may be associated with subspaces\n        that are more strongly affected by nonassociative chains in the\n        octonionic structure.\n  <li>The corresponding projectors onto neutrino subspaces can fail to\n        commute more strongly with the mass map and with certain rotor\n        operators.\n</ul><p>As a result, the overlap matrix $U_{\\text{PMNS}}$ between flavor and mass\neigenbases for leptons can naturally have large off-diagonal entries: the\nrelevant operators pick eigenbases that are more misaligned than in the\nquark case.</p>\n<h3>Qualitative patterns from exceptional constraints</h3>\n<p>The goal of the octonionic approach is not to predict every mixing angle\nand phase numerically from first principles in a single stroke. Instead, it\naims to explain why certain <em>patterns</em> appear robust:</p><ol>\n  <li><strong>Quark mixings are small:</strong> quark flavor projectors and the\n        quark part of $\\Pi(H)$ are nearly simultaneously diagonalisable\n        within the exceptional algebra, leading to small mixing angles.\n  <li><strong>Lepton mixings are large:</strong> leptonic projectors, especially\n        in the neutrino sector, have a more frustrated relation to the mass\n        map and rotor operators, leading to larger natural mixings.\n  <li><strong>Correlations between sectors:</strong> because all these operators\n        live in the same $H_3(\\mathbb{O})$ and share the same vacuum\n        configuration, patterns in the CKM and PMNS matrices are not\n        independent: a change in the internal geometry affects both.\n</ol><p>This is reminiscent of how coordinate changes on a curved manifold cannot\nbe chosen independently in overlapping charts.</p>\n<h3>Towards numerical explorations</h3>\n<p>Once a concrete vacuum configuration $\\langle H\\rangle$ and explicit forms\nfor the mass map, projectors and compressors are chosen, the model becomes\nnumerical:</p><ul>\n  <li>One can diagonalise the relevant operators in $H_3(\\mathbb{O})$ and\n        compute the induced mixing matrices.\n  <li>One can study how these matrices change under deformations of\n        $\\langle H\\rangle$ or of the internal rotor structure.\n  <li>One can search for attractor configurations that yield mixing\n        patterns close to the observed CKM and PMNS matrices.\n</ul><p>In this sense, the exceptional geometry provides a <em>parameter space</em>\nfor mixings that is much more constrained than a generic set of complex\n$3\\times3$ unitary matrices.</p><p>",
  "closing": "CKM and PMNS are read as transition maps between preferred bases in an exceptional internal space, not as arbitrary phenomenological matrices.",
  "type": "Adventssonntag (Doppelblatt)",
  "special": "Third Advent Sunday",
  "centralFormula": "Π(H)=∑_{i,j} M_{ij}⊗Φ(h_{ij}), M(H)=y Π(H); C v_i = λ_i v_i,  v_i → CKM/PMNS-Spalten",
  "dependencies": "Verankert die Massenhierarchie konkret in der Albert-Algebra und bindet Flavor-Physik direkt an die Struktur der Massenoperatoren.",
  "isLocked": true,
  "references": [
    {
      "key": "Cabibbo1963",
      "text": "N. Cabibbo, ``Unitary symmetry and leptonic decays,'' Phys. Rev. Lett. <strong>10</strong>, 531--533 (1963)."
    },
    {
      "key": "KobayashiMaskawa1973",
      "text": "M. Kobayashi and T. Maskawa, ``CP violation in the renormalizable theory of weak interaction,'' Prog. Theor. Phys. <strong>49</strong>, 652--657 (1973)."
    },
    {
      "key": "MakiNakagawaSakata1962",
      "text": "Z. Maki, M. Nakagawa and S. Sakata, ``Remarks on the unified model of elementary particles,'' Prog. Theor. Phys. <strong>28</strong>, 870--880 (1962)."
    },
    {
      "key": "GurseyTze1996",
      "text": "F. Gürsey and H. C. Tze, On the Role of Division, Jordan and Related Algebras in Particle Physics, World Scientific, 1996."
    }
  ],
  "intro": "Why do quarks mix so little, while neutrinos mix so much? The Standard Model encodes these patterns in two unitary matrices—CKM for quarks, PMNS for leptons—but offers no explanation. The numbers are simply fitted to data.\n\nThe octonionic model offers a geometric answer. Mixing matrices are not arbitrary parameters, but transition maps between different preferred bases in the exceptional internal space H₃(O). One basis is aligned with gauge interactions (flavor eigenstates), the other with the mass map Π(H) built from the vacuum ⟨H⟩ (mass eigenstates). The misalignment between these bases is what we call mixing.\n\nFor quarks, the flavor projectors and the mass map almost commute within H₃(O)—the two bases are nearly aligned, so mixing is small. For leptons, especially neutrinos, nonassociative chains in the octonionic structure frustrate this alignment—the bases are more misaligned, so mixing is large.\n\nThe mystery of mixing becomes a question of internal geometry: not 'why these numbers?' but 'why do these operators almost commute in one sector and fail to commute in another?' The exceptional structure of H₃(O) constrains the answer.",
}