{
  "day": 22,
  "date": "2025-12-22",
  "dateDisplay": "December 22, 2025",
  "title": "Charges without choice",
  "subtitle": "How the octonionic internal space fixes quantum numbers",
  "keyInsight": "Once the octonionic internal space is chosen, many quantum numbers are no longer adjustable. Electric charge, colour and weak isospin follow from how states sit inside an H₃(O)-based geometry and how the internal Dirac operator D_F acts on them. In this picture, charge assignments are not arbitrary labels but eigenvalues and representation data of a finite, highly constrained operator.",
  "intro": "<p>Until now, the calendar has mostly dealt with scales: mass ladders, near-critical vacua and possible shadow states. Today we turn to <em>labels</em>: electric charge, colour, weak isospin and hypercharge.</p>\n<p>In the Standard Model, these are introduced as representation labels under the gauge group SU(3)×SU(2)×U(1). They are chosen in such a way that the theory is anomaly-free and reproduces the observed spectrum of particles.</p>\n<p>In the octonionic framework, the situation is tighter. The internal Hilbert space on which the finite Dirac operator <em>D<sub>F</sub></em> acts is built from an <em>H</em><sub>3</sub>(O)-based geometry. The way fermionic states sit in this space, and the way internal symmetries act on it, determines which charge patterns are even possible.</p>",
  "content": "<h3>Connections and generators</h3>\n<p>The same covariant derivative that governs propagation carries both the spacetime spin connection and internal gauge connections. The generators that assign electric charge, colour and weak isospin can be read as parts of the internal sector of this derivative, acting through <em>D<sub>F</sub></em> on a finite-dimensional space.</p>\n<p>In the octonionic picture, the internal space is organised so that:</p>\n<ul>\n  <li>colour triplets and singlets arise from different blocks in an <em>H</em><sub>3</sub>(O)-related representation;</li>\n  <li>weak doublets and singlets occupy different positions with respect to certain projectors;</li>\n  <li>hypercharge is encoded in linear combinations of internal generators.</li>\n</ul>\n<p>The electric charge <em>Q</em> then appears as a specific linear combination of these internal operators, typically of the form</p>\n<p style=\"text-align:center;\"><em>Q</em> = <em>T</em><sub>3</sub> + ½ <em>Y</em>,</p>\n<p>where <em>T</em><sub>3</sub> is the third component of weak isospin and <em>Y</em> is hypercharge. Once this combination is fixed by the geometry, the allowed eigenvalues of <em>Q</em> on each fermionic state are determined by the representation theory of the internal algebra, not by hand.</p>\n\n<h3>Charges as eigenvalues of ∇₈</h3>\n<p>In this picture, familiar electric charges such as</p>\n<p style=\"text-align:center;\"><em>Q</em>(e<sup>−</sup>) = −1, <em>Q</em>(u) = +2/3, <em>Q</em>(d) = −1/3, <em>Q</em>(ν) = 0</p>\n<p>are not external labels attached by hand, but concrete eigenvalues of the internal Dirac block</p>\n<p style=\"text-align:center;\"><em>D<sub>F</sub></em>|<sub><em>H</em><sub>3</sub>(O)</sub> ⊂ ∇₈.</p>\n<p>The octonionic structure of the underlying <em>H</em><sub>3</sub>(O)-module is what enforces the observed charge pattern. In other words, the quantum numbers we assign to leptons and quarks are already written into the spectrum of ∇₈; we simply read them off as eigenvalues.</p>\n\n<h3>Concrete quantum numbers</h3>\n<p>Consider the familiar first generation. In the octonionic framework, the observed charge assignments emerge as eigenvalues:</p>\n<ul>\n  <li><strong>Electron:</strong> <em>Q<sub>e</sub></em> = −1, colour singlet, weak doublet (left-handed) or singlet (right-handed).</li>\n  <li><strong>Neutrino:</strong> <em>Q<sub>ν</sub></em> = 0, colour singlet, weak doublet (left-handed) or singlet (right-handed).</li>\n  <li><strong>Up quark:</strong> <em>Q<sub>u</sub></em> = +2/3, colour triplet, weak doublet (left-handed) or singlet (right-handed).</li>\n  <li><strong>Down quark:</strong> <em>Q<sub>d</sub></em> = −1/3, colour triplet, weak doublet (left-handed) or singlet (right-handed).</li>\n</ul>\n<p>These values are not random. They obey strict consistency conditions: anomaly cancellation, quantisation rules, and the requirement that the sum of charges in a weak doublet matches the hypercharge assignment. In the Standard Model, these are delicate constraints that must be imposed by hand. In the octonionic picture, they follow from how the internal generators act on different subspaces of the <em>H</em><sub>3</sub>(O)-based internal space.</p>\n<p>The fact that quarks carry fractional charges while leptons carry integer charges, and that the specific fractions are ±1/3 and ±2/3, is a direct consequence of how colour triplets and singlets sit in the internal geometry. The familiar pattern of the first generation then appears not as an arbitrary assignment but as one particular way in which this finite operator algebra can act on a small number of internal degrees of freedom.</p>\n\n<h3>Three generations, one pattern</h3>\n<p>The same charge pattern repeats for the second and third generations:</p>\n<ul>\n  <li>muon and tau: <em>Q</em> = −1, colour singlet;</li>\n  <li>charm and top: <em>Q</em> = +2/3, colour triplet;</li>\n  <li>strange and bottom: <em>Q</em> = −1/3, colour triplet.</li>\n</ul>\n<p>In the octonionic framework, this repetition is a consequence of triality: the internal space naturally accommodates three copies of the same representation structure, differing only in their position along generation-sensitive directions controlled by the mass operators <em>R</em> and <em>L</em>.</p>",
  "closing": "In the octonionic framework, electric charge, colour and weak isospin are not independent inputs. They emerge as eigenvalues of the internal Dirac operator D_F acting on an H₃(O)-based space. The observed charge pattern — Q_e = −1, Q_u = +2/3, Q_d = −1/3 — becomes a structural consequence, not a coincidence.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "Q = T₃ + ½ Y; Q(e⁻) = −1, Q(ν) = 0, Q(u) = +2/3, Q(d) = −1/3 as eigenvalues of D_F|_{H₃(O)} ⊂ ∇₈",
  "dependencies": "Builds on the introduction of the octonionic internal space H₃(O), the finite Dirac operator D_F, and the mass ladder; prepares the ground for the three-generation structure highlighted on December 31.",
  "isLocked": true,
  "references": [
    {
      "key": "Georgi1999",
      "text": "H. Georgi, <em>Lie Algebras in Particle Physics</em>, 2nd ed., Westview Press, 1999."
    },
    {
      "key": "PDG2022",
      "text": "R. L. Workman <em>et al.</em> (Particle Data Group), <em>Review of Particle Physics</em>, Prog. Theor. Exp. Phys. <strong>2022</strong>, 083C01 (2022)."
    }
  ]
}