{
  "day": 22,
  "date": "2025-12-22",
  "dateDisplay": "December 22, 2025",
  "title": "Constants as equilibrium values of exceptional geometry",
  "subtitle": "From a parameter list to three invariants (p_S,p_G,p_T) and an energy scale",
  "keyInsight": "Many 'fundamental constants' (α, α_s, sin²θ_W, mass ratios) are not free parameters but equilibrium values in the F₄ symmetry atlas—coordinates on orbits, not dice rolls. This is a paradigm shift: from 'measure and fit' to 'understand as geometry'. Constants are not arbitrary gifts from nature but necessary consequences of the octonionic structure.",
  "content": "<h3>Constants vs.\\ equilibrium values</h3>\n<p>In everyday language, a \"constant of nature\" is a\nnumber that does not change over time. But for theory building there is a\ndeeper question:</p><p>quote\n  Is the constant a fundamental input, or is it the value that some\n  dynamical or geometric system relaxes to?\nquote</p><p>In statistical mechanics, equilibrium temperatures and densities are not\nfundamental; they are fixed points of microscopic dynamics. The octonionic\nmodel applies this logic to parts of high-energy physics:</p><ul>\n  <li>Couplings and angles become norms and overlaps in rotor space.\n  <li>Mass scales become attractor radii of an internal flow.\n  <li>Order parameters become minima of an $F_4$-invariant potential.\n</ul>\n<h3>Electroweak scale as a potential minimum</h3>\n<p>A central example from the 4th Advent (21 December) is the electroweak\nscale $Y_S$. A Jordan potential\n\\[\n  V_J(H) = \\mu^2 \\,\\mathrm{Tr}(H^2)\n         + \\lambda\\,\\mathrm{Tr}(H^4)\n         + \\kappa\\,c\\,\\det H\n         + \\cdots\n\\]\non $H_3(\\mathbb{O})$, invariant under $F_4$, has a minimum at some vacuum\n$\\langle H\\rangle$. Reading $Y_S$ as a suitable component or invariant of\n$\\langle H\\rangle$ and minimising $V_J$ yields a relation of the type\n\\[\n  Y_S^2 = -\\frac{\\mu^2}{2(\\lambda + \\kappa c)}.\n\\]</p><p>Here $Y_S$ is not an arbitrary input; it is the equilibrium value of the\norder parameter in an exceptional potential. The observed electroweak\nscale is then analogous to a lattice spacing in a crystal: an equilibrium\ndistance, not a fundamental length.</p>\n<h3>Angles and couplings as geometric overlaps</h3>\n<p>From 10 December we remember: couplings and the Weinberg angle can be read\nfrom rotor geometry. With an inner product\n\\[\n  \\langle A,B\\rangle = \\mathrm{Tr}(A^\\dagger B),\n\\]\nand rotor directions $G_W$ (weak isospin) and $G_Y$ (hypercharge), one\ndefines\n\\[\n  \\cos\\theta_W =\n  \\frac{\\langle G_W,G_Y\\rangle}\n       {\\|G_W\\|\\,\\|G_Y\\|}.\n\\]</p><p>Similarly, $\\alpha$ and $\\alpha_s$ track the norms of appropriate\ncommutators in the internal operator space. Once the embedding of\n$SU(3)_C\\times SU(2)_L\\times U(1)_Y$ into the exceptional algebra is\nfixed, the <em>relative</em> normalisation of these norms is fixed as well.\nRunning with energy complicates the picture, but the low-energy values are\nno longer independent dials; they are correlated by the underlying\ngeometry.</p><p>In this sense, $\\theta_W$ and the ratios between $\\alpha$ and $\\alpha_s$\nare <em>geometric equilibrium values</em>: the angles and norms selected by a\nparticular embedding of the Standard Model group into the exceptional\nsymmetry.</p>\n<h3>Mass hierarchies as attractor radii</h3>\n<p>The radius operator and attractor mechanism from earlier days provide\nanother route to equilibrium values. Internal flows in the space of\nconfigurations—driven by renormalisation-group or effective potential\ngradients—develop attractors at characteristic radii\n\\[\n  R \\sim R_{\\ast,1},\\; R_{\\ast,2},\\;\\ldots\n\\]\ncorresponding to:</p><ul>\n  <li>low-energy QCD scale,\n  <li>electroweak scale,\n  <li>higher intermediate scales.\n</ul><p>Fermion masses then fall into bands or shells around these radii, with the\nprecise eigenvalues determined by the compressor spectra. The huge\nhierarchies between these radii (e.g.\\ Planck vs.\\ electroweak) can be\ntraced back to nonassociativity (8 December): strong deviations from\nassociativity produce exponential separations between attractor radii.</p><p>Thus, mass ratios are not \"inserted by hand\"; they are equilibrium\noutcomes of flows on an exceptional internal manifold.</p>\n<h3>What remains external</h3>\n<p>The equilibrium perspective is powerful but not unlimited. In the current\nstate of the model:</p><ul>\n  <li>The gravitational coupling—equivalently the Planck mass $m_P$—is\n        still external (16 December).\n  <li>The ratio $\\kappa = m_p/m_P$ is acknowledged as an input, awaiting\n        a spectral-geometry derivation.\n  <li>The cosmological constant is not yet computed from an octonionic\n        spectral action.\n</ul><p>So the slogan \"constants are equilibrium values\" is true for many, but\nnot yet for all of them. The calendar is explicit about this boundary.</p>\n<h3>Conceptual shift: from parameter lists to geometry</h3>\n<p>The main conceptual gain of this day is not a new formula but a new\nclassification:</p><ol>\n  <li><strong>Equilibrium constants:</strong>\n    values fixed by minima of potentials, attractors of flows, or fixed\n    geometric overlaps (e.g.\\ $Y_S$, many fermion masses, $\\theta_W$,\n    relative couplings).\n  <li><strong>Spectral constants (future work):</strong>\n    values to be derived from the spectrum of a combined Dirac operator in\n    spectral geometry (e.g.\\ $G$, cosmological constant).\n  <li><strong>Still-external constants:</strong>\n    numbers not yet tied to the exceptional structure in the present\n    model.\n</ol><p>This is a clear upgrade over a flat parameter list: we know which constants\nare already inside the exceptional story, which should be pulled in via\nspectral geometry, and which ones remain open.</p>\n<h3>Why this matters for physics, not just for aesthetics</h3>\n<p>From a pragmatic viewpoint, one might say: as long as the model matches\ndata, who cares whether a parameter is an input or an equilibrium value?\nThe answer is twofold:</p><ul>\n  <li><strong>Predictivity:</strong> Equilibrium values are constrained: small\n        changes in the microscopic setup lead to calculable shifts, not\n        arbitrary variations. This opens the door to quantitative tests.\n  <li><strong>Stability:</strong> Equilibrium interpretation explains why\n        certain values are robust under perturbations, decoupling of heavy\n        fields, or environmental changes.\n</ul><p>If, step by step, more of the Standard Model parameter list can be turned\ninto equilibrium values of an exceptional geometry, the notorious\n\"fine-tuning\" problems change character: we no longer tune against\nnothing; we characterise which equilibria of which internal structures are\nrealised in our Universe.</p><p>ConnesChamseddine\nA.~Connes and A.~H.~Chamseddine,\n\"The spectral action principle,\"\nCommun.\\ Math.\\ Phys. <strong>186</strong>, 731--750 (1997).</p><p>Gursey<p><strong>Tze1996</strong><br>\nF.~G\\\"ursey and H.~C.~Tze,\nOn the Role of Division, Jordan and Related Algebras in\nParticle Physics,\nWorld Scientific, 1996.</p><p>Internal\n[Internal notes on attractors, rotor norms and constants as equilibria:\narxiv-const.tex; appK\\_neu.tex; appE\\_neu.tex.]</p>",
  "closing": "In the exceptional picture, many ``constants'' are not arbitrary inputs\n   but equilibrium values: minima of $F_4$-symmetric potentials, attractor\n   radii and geometric angles in an octonionic internal space.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "Konstanten = Invarianten(F₄-Orbits)",
  "dependencies": "Paradigmenwechsel: von 'Messen und Fitten' zu 'Verstehen als Geometrie'.",
  "isLocked": true,
  "references": [
    {
      "key": "ConnesChamseddine",
      "text": "A. Connes and A. H. Chamseddine, ``The spectral action principle,'' Commun. Math. Phys. <strong>186</strong>, 731--750 (1997)."
    },
    {
      "key": "GurseyTze1996",
      "text": "F. Gürsey and H. C. Tze, On the Role of Division, Jordan and Related Algebras in Particle Physics, World Scientific, 1996."
    },
    {
      "key": "Internal",
      "text": "[Internal notes on attractors, rotor norms and constants as equilibria: arxiv-const.tex; appK_neu.tex; appE_neu.tex.] thebibliography"
    }
  ],
  "intro": "<p>In the textbook Standard Model, parameters like the fine-structure constant α, the strong coupling α_s, the Weinberg angle θ_W, fermion masses and mixing angles appear as independent inputs. In the octonionic/Albert framework, many of them can be read as equilibrium values of an exceptional geometry. A refined view goes one step further: a universe type is specified by three dimensionless invariants (p_S,p_G,p_T) associated with structural, geometric and topological/CP sectors, plus an energy scale E. The familiar constants are then coordinates of an equilibrium point in this (p_S,p_G,p_T;E) space.</p>\n\n<p>In everyday language, a 'constant of nature' is a number that does not change over time. For theory building, the deeper question is: Are these constants fundamental inputs, or are they the values that an underlying algebraic/dynamical system relaxes to?</p>\n\n<p>The Symmetry Atlas constructed in the universe-parameter paper organises all relevant operators ('genes') into five structural sectors encoding structure/kinematics (Sph), topology (Tph), CP breaking (Cph), geometry (Gph) and family/dark sector (Hph).</p>\n\n<p>From these, three canonically defined, dimensionless invariants emerge:</p>\n\n<p>p_S = I_S, p_G = I_G, p_T = I_T,</p>\n\n<p>associated with structure, geometry and topology/CP. Together with an externally chosen probe scale E>0, a universe type is specified coarsely by</p>\n\n<p>u = (p_S,p_G,p_T;E).</p>\n\n<p>The structural molecule Sph is generated by left/right multiplication L,R and a fundamental differential D. A natural invariant is built from the commutator [L,R] = LR-RL, measuring how strongly left and right actions fail to commute. A normalised trace</p>\n\n<p>I_S := Tr([L,R]ᵀ[L,R]) / (Tr(LᵀL)·Tr(RᵀR))</p>\n\n<p>vanishes if L and R commute and becomes non-zero only when a genuine non-commutative kinematics is present. We identify p_S := I_S, so that p_S measures the structural 'intensity' of non-commutativity and Lorentz-like kinematics. Without p_S≠0, there is no room for the kind of operator dynamics used throughout this calendar.</p>\n\n<p>The geometry molecule Gph contains the vierbein E_μ^a and a cosmocompressor K_Λ. Writing their norms as</p>\n\n<p>N_E = Tr(EᵀE), N_Λ = Tr(K_ΛᵀK_Λ),</p>\n\n<p>we define a dimensionless ratio</p>\n\n<p>I_G := N_Λ/N_E² = Tr(K_ΛᵀK_Λ) / [Tr(EᵀE)]².</p>\n\n<p>In an effective low-energy reading, I_G compares a cosmological compression scale to the square of the vierbein norm, i.e. to how 'stiff' spacetime geometry is. We set p_G := I_G.</p>\n\n<p>Heuristically, p_G controls the hierarchy between Planck-like scales, matter scales and the cosmological constant—the same hierarchy that in other days appeared via radius operators and attractor radii.</p>\n\n<p>Topology and CP breaking are carried by Tph and Cph. With a field-strength-like gene F∈Tph and a CP-rotator R_CP∈Cph, one defines a normalised topological angle</p>\n\n<p>θ_F := Pf(F) / [Tr(FᵀF)]²,</p>\n\n<p>and a CP-tilt</p>\n\n<p>δ_CP := Tr(R_CP L) / √(Tr(R_CPᵀR_CP)·Tr(LᵀL)).</p>\n\n<p>Their product I_T := θ_F·δ_CP vanishes if either topology or CP violation is trivial, and becomes non-zero only when both sectors are active. We interpret p_T := I_T as an asymmetry parameter of the universe.</p>\n\n<p>The triple (p_S,p_G,p_T) does not uniquely fix a universe; it labels a universe type. For each such type, one can study admissible Atlas configurations c and define notions of stability and attractor regions.</p>\n\n<p>A configuration is structurally and phenomenologically stable if small perturbations in (p_S,p_G,p_T) and c do not change which sectors are active and keep dimensionless observables nearly fixed. An attractor region A⊂ℝ³ is then a connected subset of parameter space such that: for all (p_S,p_G,p_T)∈A there exist stable configurations c, and renormalisation-group-like flows drive generic configurations towards A as the scale E is lowered.</p>\n\n<p>In this language, the observed Standard Model plus its scales and constants correspond to a point (p_S,p_G,p_T;E₀) sitting in a stable attractor region of the Symmetry Atlas.</p>\n\n<p>Against this background, the perspective on constants shifts: couplings, angles and mass ratios appear as norms, overlaps and eigenvalue ratios of operators in the sector algebras. Scales (Planck, electroweak, QCD) become radii and minima in the internal radius and potential landscape. Many of these quantities can be grouped as functions of (p_S,p_G,p_T) and the choice of attractor configuration c.</p>\n\n<p>Instead of a flat list of independent inputs, we have a map</p>\n\n<p>(p_S,p_G,p_T;E;c) ↦ {constants, scales, spectra},</p>\n\n<p>with (p_S,p_G,p_T;E) describing the type of universe and c its location in configuration space. Our universe is one equilibrium point in this higher-dimensional landscape.</p>\n\n<p>The equilibrium/parameter picture is powerful but not yet complete. In the current state of the model: the gravitational coupling (equivalently the Planck mass m_P) and the proton-Planck ratio κ=m_p/m_P are still external; they await a spectral-geometry derivation from a combined Dirac operator D. The cosmological constant has not yet been computed from an octonionic spectral action and thus does not have a clean expression in terms of (p_S,p_G,p_T).</p>\n\n<p>These caveats refine the slogan of the previous version of this day: many constants are already equilibrium values tied to (p_S,p_G,p_T) and the Atlas, but not all of them yet.</p>\n\n<p>The main conceptual gain can be summarised in two steps: constants of nature become equilibrium values: minima of F₄-symmetric potentials, attractor radii and geometric overlaps in an exceptional internal space. Whole universe types become points in a three-parameter space (p_S,p_G,p_T) with attractor regions, turning the list of possible parameter sets into a structured universe atlas.</p>\n\n<p>In this light, our universe is not just 'the one with particular numerical values', but a structurally stable equilibrium in the Symmetry Atlas of octonionic operators.</p>"
}