{
  "day": 23,
  "date": "2025-12-23",
  "dateDisplay": "December 23, 2025",
  "title": "From operators to observables",
  "subtitle": "What the octonionic framework aims to explain numerically",
  "keyInsight": "After three weeks of structural work, it is natural to ask: which observable numbers are meant to follow from the octonionic operator picture? The mass ladder, shadow spectrum, near-critical electroweak scale and fixed charge patterns all suggest that scales, charges and mixings could be read from the spectrum of a single octonionic Dirac operator.",
  "intro": "<p>Any unification attempt is only as good as the list of observables it can address. In the past days, several such targets have appeared:</p>\n<ul>\n  <li>scales on the mass ladder, from the QCD scale up to high octonionic scales;</li>\n  <li>particle masses and hierarchies;</li>\n  <li>charge and quantum-number patterns;</li>\n  <li>possible dark or shadow sectors.</li>\n</ul>\n<p>Spelling these out explicitly helps to see what the operator framework intends to explain as spectral data.</p>",
  "content": "<h3>Mass scales and hierarchies</h3>\n<p>The characteristic bands on the ladder can be viewed as clusters of eigenvalues of the internal Dirac operator <em>D<sub>F</sub></em>:</p>\n<ul>\n  <li><strong>High scales:</strong> octonionic scales such as <em>M</em><sub>8</sub> ~ 10<sup>16</sup>–10<sup>18</sup> GeV and intermediate compressor scales <em>M</em><sub>C2</sub> ~ 10<sup>12</sup>–10<sup>14</sup> GeV, <em>M</em><sub>C1</sub> ~ 10<sup>9</sup>–10<sup>11</sup> GeV;</li>\n  <li><strong>Electroweak scale:</strong> <em>v</em> ≈ 246 GeV and weak-boson masses <em>m<sub>W</sub></em> ≈ 80 GeV, <em>m<sub>Z</sub></em> ≈ 91 GeV;</li>\n  <li><strong>Low scales:</strong> the QCD scale Λ<sub>QCD</sub> ~ 200 MeV and hadronic masses.</li>\n</ul>\n<p>The octonionic mass operators <em>R</em>, <em>L</em> and their compressors organise these into a ladder. A quantitative programme would compute ratios like <em>M</em><sub>8</sub>/Λ<sub>QCD</sub> ~ 10<sup>20</sup> from this spectrum.</p>\n\n<h3>Masses, families and mixings</h3>\n<p>Beyond scales, the internal spectrum of <em>D<sub>F</sub></em> is supposed to encode three fermion generations, mass hierarchies, and mixing matrices. On the structural level, the octonionic model naturally accommodates three generations and right-handed neutrinos. Turning this into numbers would mean deriving mass ratios such as</p>\n<p style=\"text-align:center;\"><em>m<sub>μ</sub></em>/<em>m<sub>e</sub></em> ≈ 207, <em>m<sub>τ</sub></em>/<em>m<sub>μ</sub></em> ≈ 17, <em>m<sub>t</sub></em>/<em>m<sub>b</sub></em> ≈ 40</p>\n<p>from eigenvalue structures and computing mixing angles as overlaps between eigenbases. The CKM matrix elements, for instance, range from |<em>V</em><sub>ud</sub>| ≈ 0.974 to |<em>V</em><sub>ub</sub>| ≈ 0.004, while PMNS angles span from θ<sub>12</sub> ≈ 33° to θ<sub>13</sub> ≈ 8.6°.</p>\n\n<h3>Charges and dark sectors</h3>\n<p>From the internal generators of <em>D<sub>F</sub></em>, charge assignments emerge as eigenvalues on different subspaces. The same construction that distinguishes quarks from leptons also leaves room for states neutral under visible charges. In the ladder picture, these appear as shadow or dark states: eigenvectors of <em>D<sub>F</sub></em> whose couplings to visible fields are suppressed. The observables of interest are predicted mass windows — light shadow states in the GeV–TeV range, heavy shadow states near <em>M</em><sub>C2</sub> or <em>M</em><sub>8</sub> — and coupling strengths for such dark candidates.</p>\n\n<h3>A map for future work</h3>\n<p>The operator framework comes with a concrete checklist: specify <em>D<sub>F</sub></em> in an octonionic model, compute its spectrum, extract predictions for mass ratios and mixing angles, and confront these with data. The calendar does not carry out this programme, but it narrows down the question to a list of observables that should be encoded in the spectrum of an octonionic master equation",
  "closing": "The octonionic operator picture comes with a concrete list of target observables, which now must be computed and compared to data.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "Spectral data of D_F and ∇₈ ↦ {mass scales, mass ratios, CKM/PMNS angles, shadow-state mass windows}",
  "dependencies": "Summarises the mass ladder (QCD to M₈), the charge discussion (December 22), and the emerging picture of visible, neutrino-like and shadow sectors; prepares the conceptual peak on December 24.",
  "isLocked": true,
  "references": [
    {
      "key": "NuFIT2021",
      "text": "I. Esteban <em>et al.</em>, <em>The fate of hints: updated global analysis of three-flavor neutrino oscillations</em>, J. High Energy Phys. <strong>2020</strong>, 178 (2020), updated results at <code>http://www.nu-fit.org</code>."
    }
  ]
}