{
  "day": 23,
  "date": "2025-12-23",
  "dateDisplay": "December 23, 2025",
  "title": "QFT foundations reloaded: what changes in an exceptional world?",
  "subtitle": "What really changes – and what does not – with octonions, AQFT and spectra",
  "keyInsight": "Feynman diagrams are useful computational tools but not fundamental truth. AQFT and octonionic operators offer a diagram-free, structurally deeper view. Observables are functionals on the algebra 𝔄(O), not sums over graphs. This frees QFT from the 'perturbation-theory lens' and opens space for exact structures.",
  "content": "<h3>What survives untouched</h3>\n<p>Despite octonions, Jordan algebras and spectral tricks,\nseveral pillars of QFT remain in place:</p><ul>\n  <li>Locality and causality are still enforced via commutation\n        relations or, in AQFT language, via locality of the net\n        $\\mathcal{O}\\mapsto\\mathcal{A}(\\mathcal{O})$.\n  <li>States are still positive linear functionals on an operator\n        algebra; probabilities are still given by expectation values and\n        Born's rule.\n  <li>Renormalisation, running couplings and effective-field-theory\n        reasoning retain their conceptual role.\n</ul><p>In that sense, the octonionic programme is not a revolution <em>against</em>\nQFT; it is a reorganisation <em>within</em> its operator framework.</p>\n<h3>What changes in the kinematical stage</h3>\n<p>The radical part lies in the choice of underlying structures:</p><ul>\n  <li>The internal Hilbert space is no longer an arbitrary finite tensor\n        product; it is tied to the representation theory of\n        $\\mathbb{O}$ and $H_3(\\mathbb{O})$.\n  <li>Gauge groups are not postulated separately; they emerge from\n        automorphisms of these exceptional structures.\n  <li>Mass and mixing operators (compressors, mass map) are not generic\n        matrices but constrained by the geometry of the Albert algebra.\n</ul><p>Instead of a long list of independent fields and representations, we start\nfrom a <em>single</em> exceptional stage and let its operator content\nunfold. QFT then lives on this stage rather than on an arbitrary internal\ntensor product.</p>\n<h3>From Lagrangians to operator toolboxes</h3>\n<p>Traditional QFT is written in terms of Lagrangian densities:\n\\[\n  \\mathcal{L}\n  = \\mathcal{L}_{\\text{kinetic}}\n  + \\mathcal{L}_{\\text{gauge}}\n  + \\mathcal{L}_{\\text{Yukawa}}\n  + \\cdots,\n\\]\nwith many a priori free couplings. In the octonionic/AQFT picture the\nprimary objects are:</p><ul>\n  <li>local algebras $\\mathcal{A}(\\mathcal{O})$ containing rotors,\n        compressors and $H$-fluctuation modes,\n  <li>a Dirac operator $D$ (spectral geometry) encoding kinetic and\n        gauge structure,\n  <li>a Jordan potential $V_J(H)$ encoding vacuum structure.\n</ul><p>A Lagrangian can still be written down as an effective description, but it\nis now a <em>derived summary</em> of spectral and algebraic data, not the\nfundamental starting point. This flips the usual order:</p><p>quote\n  Operator geometry first, Feynman rules later.\nquote</p>\n<h3>Fields vs.\\ modes of an exceptional vacuum</h3>\n<p>Another shift concerns what we call \"fundamental fields\". In the\nStandard Model language:</p><ul>\n  <li>gauge fields $A_\\mu$,\n  <li>fermion fields $\\psi$,\n  <li>the Higgs scalar $H$,\n</ul>\nappear side by side as basic degrees of freedom.</p><p>In the exceptional picture:</p><ul>\n  <li>Fermion multiplets arise as specific representations of\n        $H_3(\\mathbb{O})$ and its rotor algebra.\n  <li>Masses come from the spectrum of the mass map $\\Pi(\\langle H\\rangle)$.\n  <li>The Higgs becomes a fluctuation mode of the vacuum element\n        $\\langle H\\rangle$, not the origin of mass (11 December).\n</ul><p>Gauge fields still appear as connections, but their group structure and\ncouplings are read from rotor geometry. The distinction between \"matter\"\nand \"mediator\" fields becomes partly a matter of which operators we\nchoose to treat as background (vacuum) and which as excitations.</p>\n<h3>Parameters vs.\\ equilibrium data</h3>\n<p>From 22 December we learned to reclassify constants:</p><ul>\n  <li>Many couplings and mass scales become equilibrium values:\n        minima of an $F_4$-symmetric potential or attractor radii.\n  <li>Angles like $\\theta_W$ become literal angles between rotor\n        directions.\n  <li>Only a small core of numbers (notably those tied to gravity)\n        remain external in the current state of the model.\n</ul><p>In QFT language this means: the space of possible Lagrangians is no longer\na huge free parameter space; it is the image of a much smaller space of\nexceptional-geometric choices (vacuum embeddings, embeddings of the gauge\ngroup, spectral scales).</p>\n<h3>AQFT and spectral geometry as consistency checks</h3>\n<p>Finally, AQFT and spectral geometry serve as consistency filters:</p><ul>\n  <li><strong>AQFT</strong> asks whether the operator content can be organised\n        into a local, covariant net of algebras with reasonable state\n        structure (18 and 21 December).\n  <li><strong>Spectral geometry</strong> asks whether there exists a Dirac\n        operator whose spectral action reproduces both the internal\n        dynamics and gravity in a controlled expansion (17 December).\n</ul><p>Many aesthetically pleasing algebraic constructions fail one or both of\nthese tests. The exceptional model sketched in this calendar is designed\nto at least plausibly pass them, even if the full computations are still\npending.</p>\n<h3>What this means for the next century of QFT</h3>\n<p>Seen from the long Heisenberg-to-now perspective, the 23 December message\nis:</p><ol>\n  <li>QFT is not in crisis; its operator foundation is robust enough to\n        host even nonassociative internal geometries.\n  <li>The real opportunity lies in upgrading the internal stage from an\n        ad-hoc product of vector spaces to a rigid exceptional algebra\n        with built-in hierarchies and symmetry.\n  <li>Spectral geometry and AQFT are not fringe formalisms but natural\n        languages for such a stage.\n</ol><p>If this programme succeeds, the textbooks of 2125 might still teach\nFeynman diagrams and path integrals—but as calculational tools built on\ntop of a deeper story where octonions, spectra and local algebras quietly\ndecide which Lagrangians are even allowed.</p><p><p><strong>Haag1996</strong><br>\nR.~Haag,\nLocal Quantum Physics,\nSpringer, 1996.</p><p><p><strong>Connes1994</strong><br>\nA.~Connes,\nNoncommutative Geometry,\nAcademic Press, 1994.</p><p><p><strong>Heisenberg1925</strong><br>\nW.~Heisenberg,\n``\\\"Uber quantentheoretische Umdeutung kinematischer und\nmechanischer Beziehungen,''\nZ.\\ Phys. <strong>33</strong>, 879--893 (1925).</p><p>Internal\n[Internal notes on foundational aspects of the octonionic model:\nchap18\\_neu.tex; chap21\\_neu.tex; appF\\_neu.tex.]</p>",
  "closing": "The exceptional programme does not overthrow QFT; it rewrites its\n   kinematical stage and parameter space in terms of octonionic geometry,\n   spectra and local algebras—leaving probability intact but reshaping\n   what counts as ``fundamental''.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "Observable = Funktionale auf 𝔄(O), nicht Summe über Graphen",
  "dependencies": "Befreit QFT von der 'Störungstheorie-Brille' und öffnet Raum für exakte Strukturen.",
  "isLocked": true,
  "references": [
    {
      "key": "Haag1996",
      "text": "R. Haag, Local Quantum Physics, Springer, 1996."
    },
    {
      "key": "Connes1994",
      "text": "A. Connes, Noncommutative Geometry, Academic Press, 1994."
    },
    {
      "key": "Heisenberg1925",
      "text": "W. Heisenberg, ``Über quantentheoretische Umdeutung kinematischer und mechanischer Beziehungen,'' Z. Phys. <strong>33</strong>, 879--893 (1925)."
    },
    {
      "key": "Internal",
      "text": "[Internal notes on foundational aspects of the octonionic model: chap18_neu.tex; chap21_neu.tex; appF_neu.tex.] thebibliography"
    }
  ],
  "intro": "<p>By now the calendar has introduced octonionic internal geometry, rotor/compressor operators, spectral geometry and algebraic QFT. This day steps back and asks: what does all this really change in quantum field theory? The answer is both modest and radical: the basic probabilistic structure of QFT remains, but the kinematical stage, the list of 'fundamental' fields and the status of parameters are reshaped by exceptional algebra and operator language.</p>\n\n<p>Despite octonions, Jordan algebras and spectral tricks, several pillars of QFT remain in place: locality and causality are still enforced via commutation relations or, in AQFT language, via locality of the net 𝒪↦𝒜(𝒪). States are still positive linear functionals on an operator algebra; probabilities are still given by expectation values and Born's rule. Renormalisation, running couplings and effective-field-theory reasoning retain their conceptual role.</p>\n\n<p>In that sense, the octonionic programme is not a revolution against QFT; it is a reorganisation within its operator framework.</p>\n\n<p>The radical part lies in the choice of underlying structures: the internal Hilbert space is no longer an arbitrary finite tensor product; it is tied to the representation theory of 𝕆 and H₃(𝕆). Gauge groups are not postulated separately; they emerge from automorphisms of these exceptional structures. Mass and mixing operators (compressors, mass map) are not generic matrices but constrained by the geometry of the Albert algebra.</p>\n\n<p>Instead of a long list of independent fields and representations, we start from a single exceptional stage and let its operator content unfold. QFT then lives on this stage rather than on an arbitrary internal tensor product.</p>\n\n<p>Traditional QFT is written in terms of Lagrangian densities:</p>\n\n<p>ℒ = ℒ_kinetic + ℒ_gauge + ℒ_Yukawa + ...,</p>\n\n<p>with many a priori free couplings. In the octonionic/AQFT picture the primary objects are: local algebras 𝒜(𝒪) containing rotors, compressors and H-fluctuation modes, a Dirac operator D (spectral geometry) encoding kinetic and gauge structure, and a Jordan potential V_J(H) encoding vacuum structure.</p>\n\n<p>A Lagrangian can still be written down as an effective description, but it is now a derived summary of spectral and algebraic data, not the fundamental starting point. This flips the usual order: Operator geometry first, Feynman rules later.</p>\n\n<p>Another shift concerns what we call 'fundamental fields'. In the Standard Model language: gauge fields A_μ, fermion fields ψ, and the Higgs scalar H appear side by side as basic degrees of freedom.</p>\n\n<p>In the exceptional picture: fermion multiplets arise as specific representations of H₃(𝕆) and its rotor algebra. Masses come from the spectrum of the mass map Π(⟨H⟩). The Higgs becomes a fluctuation mode of the vacuum element ⟨H⟩, not the origin of mass (11 December).</p>\n\n<p>Gauge fields still appear as connections, but their group structure and couplings are read from rotor geometry. The distinction between 'matter' and 'mediator' fields becomes partly a matter of which operators we choose to treat as background (vacuum) and which as excitations.</p>\n\n<p>From 22 December we learned to reclassify constants: many couplings and mass scales become equilibrium values: minima of an F₄-symmetric potential or attractor radii. Angles like θ_W become literal angles between rotor directions. Only a small core of numbers (notably those tied to gravity) remain external in the current state of the model.</p>\n\n<p>In QFT language this means: the space of possible Lagrangians is no longer a huge free parameter space; it is the image of a much smaller space of exceptional-geometric choices (vacuum embeddings, embeddings of the gauge group, spectral scales).</p>\n\n<p>Finally, AQFT and spectral geometry serve as consistency filters: AQFT asks whether the operator content can be organised into a local, covariant net of algebras with reasonable state structure (18 and 21 December). Spectral geometry asks whether there exists a Dirac operator whose spectral action reproduces both the internal dynamics and gravity in a controlled expansion (17 December).</p>\n\n<p>Many aesthetically pleasing algebraic constructions fail one or both of these tests. The exceptional model sketched in this calendar is designed to at least plausibly pass them, even if the full computations are still pending.</p>\n\n<p>Seen from the long Heisenberg-to-now perspective, the 23 December message is: QFT is not in crisis; its operator foundation is robust enough to host even nonassociative internal geometries. The real opportunity lies in upgrading the internal stage from an ad-hoc product of vector spaces to a rigid exceptional algebra with built-in hierarchies and symmetry. Spectral geometry and AQFT are not fringe formalisms but natural languages for such a stage.</p>\n\n<p>If this programme succeeds, the textbooks of 2125 might still teach Feynman diagrams and path integrals—but as calculational tools built on top of a deeper story where octonions, spectra and local algebras quietly decide which Lagrangians are even allowed.</p>"
}