{
  "day": 3,
  "date": "2025-12-03",
  "dateDisplay": "December 3, 2025",
  "title": "G2 as the minimal exceptional symmetry",
  "subtitle": "The 14-dimensional gatekeeper of the octonions",
  "keyInsight": "G₂ is the smallest exceptional Lie group and the unique automorphism group of the octonions. With 14 dimensions and no complex representations, it is tailor-made for real, nonassociative physics. Every internal symmetry and operator in the model must respect G₂, making it the gatekeeper of the octonionic structure.",
  "content": "<h3>What is G$_2$?</h3>\n<p></p><p>The group $G_2$ can be defined in many equivalent ways.\nFor the octonionic story, the most natural is:</p><p>\\[\n  G_2 = \\mathrm{Aut}(\\mathbb{O}),\n\\]</p><p>the group of all linear transformations of $\\mathbb{O}$ that preserve the\noctonionic product and the norm. It is a 14-dimensional, compact,\nconnected, simply-connected Lie group and the smallest of the five\nexceptional Lie groups.</p><p>Concretely:</p><ul>\n  <li>$G_2$ preserves the multiplication table of the seven imaginary\n        units $e_1,\\dots,e_7$.\n  <li>It preserves the standard norm $|x|^2 = x\\bar{x}$.\n  <li>It acts transitively on the unit sphere of imaginary octonions,\n        with stabiliser isomorphic to $SU(3)$.\n</ul><p>In other words, $G_2$ is the full continuous symmetry group of the\noctonionic number system itself.</p>\n <p>Equivalently, one can view $G_2$ as the subgroup of $SO(7)$ that preserves\nboth the Euclidean inner product and a distinguished $3$-form (or,\nequivalently, a cross product) on the $7$-dimensional space $\\mathbb{R}^7$ of imaginary\noctonions (those with vanishing real coordinates).</p>\n<p>In representation-theoretic terms, $G_2$ has rank~$2$, with two smallest\nnon-trivial representations:\n<ul>\n    <li>the $7$-dimensional fundamental representation on the imaginary\n          octonions, and\n    <li>the $14$-dimensional adjoint representation on its Lie algebra\n          $\\mathfrak{g}_2$.\n</ul>\nUnder the $SU(3)$ subgroup that fixes a chosen imaginary unit, these\nrepresentations decompose as\n\\[\n  7 \\;\\cong\\; 1 \\oplus 3 \\oplus \\bar{3}, \\qquad\n  14 \\;\\cong\\; 8 \\oplus 3 \\oplus \\bar{3},\n\\]\na pattern that already hints at colour-like structures.</p>\n<p>In other words, $G_2$ is the full continuous symmetry group of the\noctonionic number system itself.</p>\n<h3> Why \"minimal exceptional\" matters</h3>\n<p>As a Lie group, $G_2$ is:</p><ul>\n  <li>too small to host all Standard Model symmetries directly,\n  <li>but large enough to control the essential nonassociative structure\n        of $\\mathbb{O}$,\n  <li>and exceptional — meaning it does not fit into the infinite $A_n$,\n        $B_n$, $C_n$, $D_n$ series.\n</ul><p>This makes $G_2$ an ideal starting point:</p><ul>\n  <li>It is restrictive enough to strongly constrain internal operators.\n  <li>It is flexible enough to embed subgroups that resemble\n        $SU(3)_C\\times SU(2)_L\\times U(1)_Y$ in appropriate ways.\n  <li>It naturally sits inside the larger exceptional group\n        $F_4$, the automorphism group of the Albert algebra\n        $H_3(\\mathbb{O})$.\n</ul>\n<h3>G$_2$ as a gatekeeper of allowed operators</h3>\n<p>In the model, internal operators (heptagon operator, radius operator,\nrotors, compressors) are not arbitrary matrices; they must be compatible\nwith the $G_2$-structure. Informally:</p><p><blockquote>\n  If an operator would break $G_2$ in an uncontrolled way, it is not part\n  of the fundamental toolbox.\n</blockquote></p><p>This has two important consequences:</p><ol>\n  <li><strong>Restricted parameter space:</strong>\n    many couplings and mass terms that are allowed in a generic\n    field-theory Lagrangian are simply forbidden by $G_2$.\n  <li><strong>Natural subgroups:</strong>\n    gauge groups that actually appear (or approximate) in low-energy\n    physics are precisely those that can be embedded in $G_2$ (and later\n    in $F_4$) in a structurally compatible way.\n</ol><p>$G_2$ thus serves as a first filter between ``any algebraic\nconstruction on $\\mathbb{R}^8$'' and ``constructions that respect the\noctonionic number system''.</p>\n<h3>From G$_2$ to F$_4$</h3></p><p>Later in the calendar, the Albert algebra $H_3(\\mathbb{O})$ will appear,\nand with it the larger exceptional group $F_4$:</p><p>\\[\n  F_4 = \\mathrm{Aut}\\big(H_3(\\mathbb{O})\\big).\n\\]</p><p>The relationship is hierarchical:</p><ul>\n  <li>$G_2$ controls the algebra of $\\mathbb{O}$ itself.\n  <li>$H_3(\\mathbb{O})$ builds $3\\times3$ Hermitian matrices over\n        $\\mathbb{O}$.\n  <li>$F_4$ controls the automorphisms of this larger Jordan algebra.\n</ul><p>From the perspective of the calendar:</p><ul>\n  <li>early days: $G_2$ and triality structure the octonionic stage,\n  <li>middle days: $F_4$ organises the symmetry atlas on the Albert\n        algebra,\n  <li>later days: potentials and equilibria on this atlas fix physical\n        scales and constants.\n</ul><p>$G_2$ is the first rung on this exceptional ladder.</p>\n<h3>Conceptual gain from G$_2$</h3>\n<p>Putting $G_2$ at the base of the internal symmetry story has clear\nadvantages:</p><ol>\n  <li><strong>Uniqueness:</strong> There is only one real division algebra with\n    7 imaginary units, and only one connected Lie group that preserves it:\n    $G_2$. This is about as far from \"model building by choice\" as one\n    can get.\n  <li><strong>Rigidity:</strong> Once octonions are chosen, $G_2$ is fixed.\n    Internal symmetries are no longer free groups to be dialled but are\n    inherited from this starting point.\n  <li><strong>Roadmap:</strong> The inclusion $G_2\\subset F_4$ provides a clear\n    path from basic number system to full symmetry atlas.\n</ol><p>In this sense, $G_2$ is not just an exotic group in a classification\ntable; it is the minimal exceptional guardian of the octonionic world.</p>",
  "closing": "G₂ is the 14-dimensional automorphism group of the octonions and the minimal exceptional symmetry. In the model it acts as a gatekeeper: only operators and symmetries compatible with G₂ are admitted into the internal stage on which all later structures are built.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "G₂ = Aut(O); dim(G₂)=14",
  "dependencies": "G₂ ist der 'Wächter' der oktonionalen Struktur und Ausgangspunkt für F₄.",
  "isLocked": true,
  "references": [
    {
      "key": "Engel1900",
      "text": "F. Engel, ``Ein neues, dem linearen Komplexe analoges Gebilde,'' Ber. Verh. Königl. Sächs. Ges. Wiss. Leipzig <strong>52</strong>, 63--74 (1900)."
    },
    {
      "key": "Bryant1987",
      "text": "R. L. Bryant, ``Metrics with exceptional holonomy,'' Ann. Math. <strong>126</strong>, 525--576 (1987)."
    },
    {
      "key": "Baez2002",
      "text": "J. C. Baez, ``The octonions,'' Bull. Amer. Math. Soc. <strong>39</strong>, 145--205 (2002)."
    }
  ],
  "intro": "<p>Every number system has a symmetry group—the set of transformations that preserve its essential structure. For the real numbers $\\mathbb{R}$, the symmetry is trivial: only multiplication by $\\pm1$. For the complex numbers $\\mathbb{C}$, it's rotations in the plane, or $U(1)$. For the quaternions $\\mathbb{H}$, it's $SU(2)$, as we saw yesterday.</p>\n\n<p>What about the octonions? The symmetry group of the octonions—the transformations that preserve both the multiplication table and the norm—is called $G_2$. It's a 14-dimensional Lie group, and it's the smallest of the five exceptional Lie groups. \"Exceptional\" means it doesn't fit into the infinite families of classical groups like $SU(n)$, $SO(n)$, or $Sp(n)$. It's a one-of-a-kind structure.</p>\n\n<p>Why does this matter for physics? Because $G_2$ acts as a gatekeeper. If we're building a model where internal degrees of freedom live in an octonionic space, then any operator, any symmetry, any interaction must respect the $G_2$ structure. You can't just write down arbitrary matrices and hope they make sense—they have to be compatible with the rigid multiplication rules of the octonions.</p>\n\n<p>This is a feature, not a bug. In conventional field theory, we have enormous freedom to choose gauge groups, representations, and couplings. This freedom is both a blessing and a curse: it allows us to fit data, but it doesn't explain why nature chose one particular set of parameters over another. With $G_2$ as the starting point, much of that freedom disappears. The structure is forced on us by the choice of octonions.</p>\n\n<p>Here's a concrete example: $G_2$ contains $SU(3)$ as a subgroup. In fact, if you pick any imaginary octonion and ask which transformations leave it fixed, you get a copy of $SU(3)$. This is not a coincidence—it's a hint that the color symmetry of the strong force might be a natural subgroup of the octonionic automorphism group.</p>\n\n<p>But $G_2$ is not large enough to contain the full Standard Model gauge group $SU(3) \\times SU(2) \\times U(1)$ directly. For that, we'll need to move to a larger structure: the Albert algebra $H_3(\\mathbb{O})$ and its automorphism group $F_4$, which we'll meet in the coming days. $G_2$ is the first rung on the exceptional ladder—the minimal exceptional symmetry that controls the octonionic stage itself.</p>\n\n<p>Think of today's sheet as introducing the guardian of the internal space. $G_2$ is not just an exotic group in a classification table. It's the symmetry that makes the octonions work as a number system, and in the model we're building, it's the symmetry that constrains which internal structures are allowed and which are forbidden.</p>\n\n<p>Let us see how $G_2$ guards the octonionic multiplication table.</p>"
}