{
  "day": 2,
  "date": "2025-12-02",
  "dateDisplay": "December 2, 2025",
  "title": "Triality: three equal 8D representations",
  "subtitle": "When space, matter and antimatter share the same dimension",
  "keyInsight": "Spin(8) has a unique feature: \\emph{triality}. It admits three equivalent 8-dimensional representations—one vector representation $V_8$ and two chiral spinor representations $S_8^+$ and $S_8^-$. This is not a decorative curiosity: it provides a geometric template for three kinds of ``8-dimensional stuff'' that can later be read as space, matter and antimatter. Today we meet triality as a symmetry between representations; later days will turn it into the organising
  principle behind three fermion generations.",
  "content": "<h3>Three eights instead of one</h3>\n<p>In most Lie groups, vector and spinor representations\nlook different and behave differently. Spin(8) is special: it has</p><p>\\[\n  V_8,\\qquad S_8^+,\\qquad S_8^-,\n\\]</p><p>three irreducible 8-dimensional representations that are related by a\nnontrivial outer automorphism group of order 6. This automorphism group\nacts by permuting $(V_8, S_8^+, S_8^-)$; its $\\mathbb{Z}_3$-part is called\n<em>triality</em>:</p><p>\\[\n  S:\\quad V_8 \\;\\longrightarrow\\; S_8^+ \n         \\;\\longrightarrow\\; S_8^- \n         \\;\\longrightarrow\\; V_8.\n\\]</p><p>Geometrically, the three representations are on equal footing: no one is\nmore fundamental than the others.</p>\n<h3>Why triality matters for an octonionic model</h3>\n<p>Octonions $\\mathbb{O}$ naturally support an 8-dimensional real\nrepresentation. In the model described by this calendar, one uses:</p><ul>\n  <li>an 8D \"vector-like\" role associated with internal space\n        directions,\n  <li>two 8D \"spinor-like\" roles associated with chiral matter and\n        antimatter sectors.\n</ul><p>Triality then becomes the statement that there is an underlying symmetry\nrelating these three roles. It is the reason why it is natural to package\ninternal degrees of freedom in blocks of size 8 and why it is not absurd\nto think of space-like and matter-like sectors as different faces of the\nsame algebraic coin.</p>\n<h3>From three 8D reps to three generations</h3>\n<p>The XLS plan for the calendar reserves a later day (12 December) for the\nstatement:</p><p>quote\n  ``Three fermion generations mirror the three triality\n  representations.''\nquote</p><p>Today we prepare that statement conceptually:</p><ul>\n  <li>If there is a symmetry that permutes $(V_8, S_8^+, S_8^-)$,\n        it is natural to try to attach one 8D \"copy\" of the internal\n        structure to each of them.\n  <li>In particle language, this suggests three families of fermions\n        with identical gauge quantum numbers but different ``triality\n        label''.\n  <li>The existence of <em>exactly</em> three such representations\n        motivates the existence of <em>exactly</em> three generations, not\n        one or four.\n</ul><p>The details (how charges and masses are assigned in each block) are left\nto the later flavor and generation days. The conceptual point is simple:</p><p>quote\n  Three fermion generations are not an arbitrary count; they reflect a\n  built-in threefold symmetry of Spin(8).\nquote</p>\n<h3>Link to octonions and G$_2$</h3>\n<p>Spin(8) and octonions are tightly linked:</p><ul>\n  <li>The group $G_2$ is the automorphism group of the octonions\n        $\\mathbb{O}$.\n  <li>Spin(8) acts on $\\mathbb{O}$ in ways compatible with this\n        $G_2$-structure.\n  <li>Triality is a statement about how vector and spinor actions can be\n        interchanged without breaking the internal octonionic structure.\n</ul><p>In the broader project, this becomes one ingredient in the\n<em>symmetry atlas</em>:</p><ul>\n  <li>$G_2$ as the minimal exceptional symmetry (tomorrow),\n  <li>$F_4$ as the automorphism group of the Albert algebra $H_3(\\mathbb{O})$,\n  <li>triality as the bridge between space-like and spinor-like sectors.\n</ul>\n<h3>Conceptual gain from triality</h3>\n<p>What is gained by taking triality seriously?</p><ol>\n  <li><strong>Symmetry-based multiplicity:</strong>\n    the multiplicity \"three\" is not an afterthought but a symmetry\n    consequence.\n  <li><strong>Unified treatment of sectors:</strong>\n    space-like, matter-like and antimatter-like sectors share the same\n    dimension and are related by an actual group action.\n  <li><strong>Constraints for model building:</strong>\n    any attempt to modify the number of generations must explain how\n    triality is broken or extended.\n</ol><p>Instead of asking \"Why three generations?\" as a bare phenomenological\nquestion, the model asks a more geometric one:</p><p>quote\n  How does Spin(8) triality appear inside the octonionic/Albert\n  structure, and how does it force a threefold replication of internal\n  degrees of freedom?\nquote</p><p><p><strong>Cartan1925</strong><br>\nE.~Cartan,\n``Le principe de dualit\\'e et la th\\'eorie des groupes simples et\nsemi-simples,''\nBull.\\ Sci.\\ Math. <strong>49</strong>, 361--374 (1925).</p><p><p><strong>Baez2002</strong><br>\nJ.~C.~Baez,\n\"The octonions,\"\nBull.\\ Amer.\\ Math.\\ Soc. <strong>39</strong>, 145--205 (2002).</p><p>Internal\n[Internal notes on triality and its role in generation structure:\nchap01\\_neu.tex; appA\\_neu.tex; appN\\_neu.tex.]</p>",
  "closing": "Triality of Spin(8) provides three equal 8D representations. In an\n   octonionic model, this becomes the natural algebraic source of the\n   threefold replication of fermion content that we observe as\n   ``three generations''.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "S: V₈ ↔ S₈⁺ ↔ S₈⁻ (Trialität)",
  "dependencies": "Fundamentale Symmetrie, die Generationenstruktur und Chiralität geometrisch verankert.",
  "isLocked": true,
  "references": [
    {
      "key": "Cartan1925",
      "text": "E. Cartan, ``Le principe de dualité et la théorie des groupes simples et semi-simples,'' Bull. Sci. Math. <strong>49</strong>, 361--374 (1925)."
    },
    {
      "key": "Baez2002",
      "text": "J. C. Baez, ``The octonions,'' Bull. Amer. Math. Soc. <strong>39</strong>, 145--205 (2002)."
    }
  ],
  "intro": "<p>In most areas of physics, vectors and spinors are fundamentally different creatures. Vectors describe things like position, momentum, or electric fields—they transform in a straightforward way under rotations. Spinors describe fermions like electrons and quarks—they transform in a more subtle, \"square-root\" way that captures the essence of quantum spin.</p>\n\n<p>But there's one special case where this distinction blurs: the group $\\mathrm{Spin}(8)$, which governs rotations in eight dimensions. This group has a unique property called triality, discovered by Élie Cartan in 1925. It says that $\\mathrm{Spin}(8)$ has three eight-dimensional representations—one vector representation $V_8$ and two chiral spinor representations $S_8^+$ and $S_8^-$—and these three are related by a symmetry that permutes them.</p>\n\n<p>Think about what this means: in eight dimensions, \"space-like\" and \"matter-like\" degrees of freedom can be put on equal footing. There's an automorphism of $\\mathrm{Spin}(8)$ that literally rotates the vector representation into a spinor representation and vice versa. This is not true in four dimensions, or six dimensions, or any other dimension—only in eight.</p>\n\n<p>Why does this matter for particle physics? Because the octonionic model we're building naturally lives in eight dimensions, and triality provides a geometric template for organizing internal degrees of freedom. If we have three equivalent eight-dimensional \"slots,\" it's natural to ask: could these three slots correspond to the three generations of quarks and leptons?</p>\n\n<p>This is not just numerology. The Standard Model has exactly three generations—three copies of the same pattern of quarks and leptons, with identical gauge quantum numbers but different masses. No one knows why. Conventional field theory offers no explanation; it simply accepts \"three\" as an input parameter.</p>\n\n<p>But in an octonionic model with triality, the number three is not arbitrary. It's built into the symmetry structure of $\\mathrm{Spin}(8)$. The three representations $(V_8, S_8^+, S_8^-)$ provide three natural \"homes\" for three copies of the internal structure. Triality doesn't just allow three generations—it suggests them.</p>\n\n<p>Today's sheet introduces triality as a symmetry between representations. Later in the calendar, we'll see how this abstract symmetry unfolds into the concrete pattern of three fermion families. For now, the key takeaway is simple: the number three in \"three generations\" might not be an accident. It might be the echo of an exceptional symmetry in eight dimensions.</p>\n\n<p>Let us see how triality organizes the octonionic stage.</p>"
}