{
  "day": 1,
  "date": "2025-12-01",
  "dateDisplay": "December 1, 2025",
  "title": "Quaternions as prototype for SU(2) and the weak force",
  "subtitle": "The $1\\oplus3$ pattern that scales up to octonions",
  "keyInsight": "Before we climb to the eight-dimensional octonions, it is worth pausing at their four-dimensional cousins, the quaternions $\\mathbb{H}\\cong\\mathbb{R}^4$. The quaternion units realise a rigid $1\\oplus3$ split of scalar and vector parts, and their automorphism group contains $SU(2)$—the very group of weak isospin. The octonionic $8\\times8$ action simply doubles this pattern: what $\\mathbb{H}$ does for $SU(2)$, $\\mathbb{O}$ does for the full internal structure of one generation.",
  "content": "<h3>The quaternion stage in four dimensions</h3>\n\n<p>The quaternions\n\\[\n  \\mathbb{H} = \\{\\, a + b\\,\\mathbf{i} + c\\,\\mathbf{j} + d\\,\\mathbf{k}\n            \\mid a,b,c,d\\in\\mathbb{R}\\,\\}\n\\]\nform a four-dimensional division algebra with basis\n$1,\\mathbf{i},\\mathbf{j},\\mathbf{k}$ and relations\n\\[\n  \\mathbf{i}^2=\\mathbf{j}^2=\\mathbf{k}^2 = \\mathbf{ijk} = -1.\n\\]\n</p>\n\n<p>Two structural facts are important for physics:</p>\n\n<ul>\n  <li>$\\mathbb{H}$ splits as scalar $\\oplus$ vector:\n        \\[\n          \\mathbb{H} \\cong \\mathbb{R}\\,\\oplus\\,\\mathbb{R}^3,\n        \\]\n        i.e.\\ $1\\oplus3$.\n  <li>Left and right multiplication by unit quaternions act as\n        rotations on the vector part $\\mathbb{R}^3$.\n</ul>\n\n<p>This already looks like a toy model for spin and isospin: one distinguished scalar component, three correlated vector components.</p>\n\n<h3>$SU(2)$ inside the quaternion automorphisms</h3>\n\n<p>Unit quaternions form a group isomorphic to $SU(2)$:\n\\[\n  \\{q\\in\\mathbb{H} \\mid |q|=1\\} \\;\\simeq\\; SU(2).\n\\]\nLeft multiplication by such a unit quaternion acts as an $SU(2)$ matrix on\nthe $(\\mathbf{i},\\mathbf{j},\\mathbf{k})$ components. Concretely:</p>\n\n<ul>\n  <li>The scalar part $a$ stays invariant.\n  <li>The vector part $(b,c,d)$ transforms as a 3-vector under $SO(3)$,\n        double-covered by $SU(2)$.\n</ul>\n\n<p>In this language, weak isospin $SU(2)$ is not an abstract label group; it is <em>literally</em> the automorphism group of a number system.</p>\n\n<h3>Action matrices and the $1\\oplus3$ pattern</h3>\n\n<p>In the full model, internal degrees of freedom are encoded via action matrices built from left and right multiplication:\n\\[\n  L_q: x \\mapsto qx,\\qquad\n  R_q: x \\mapsto xq.\n\\]\n</p>\n\n<p>Already for $\\mathbb{H}$, these left/right actions decompose the four-dimensional real space into a scalar plus a three-dimensional subspace. In matrix form this appears as a rigid $1\\oplus3$ block structure in the $4\\times4$ representation of $L_q$ and $R_q$.</p>\n\n<p>Physically:</p>\n\n<ul>\n  <li>The singlet direction (scalar part) is a natural candidate for an isospin-neutral component.\n  <li>The triplet directions (vector part) form a weak isospin triplet under $SU(2)$.\n</ul>\n\n<p>This is the exact pattern that will be reused and doubled when we move to the octonionic $8\\times8$ actions.</p>\n\n<h3>From quaternions to octonions</h3>\n\n<p>The step from $\\mathbb{H}$ to $\\mathbb{O}$ looks dramatic—nonassociativity, seven imaginary units—but in the action-matrix picture it becomes transparent:</p>\n\n<ul>\n  <li>The four real components of $\\mathbb{H}$ become eight real components for $\\mathbb{O}$.\n  <li>The $1\\oplus3$ pattern of scalar/vector parts becomes a richer pattern that can host one full generation of internal quantum numbers.\n  <li>The role of $SU(2)\\subset\\mathrm{Aut}(\\mathbb{H})$ is taken over by $G_2\\subset\\mathrm{Aut}(\\mathbb{O})$.\n</ul>\n\n<p>From this vantage point, $SU(2)$-weak is not an isolated gauge factor; it is the visible shadow of quaternionic automorphisms inside a larger octonionic structure.</p>\n\n<h3>Why this detour matters</h3>\n\n<p>The quaternion day serves three purposes in the Advent story:</p>\n\n<ol>\n  <li><strong>Familiarity:</strong> it connects the exotic octonionic picture to the well-known role of $SU(2)$ in spin and weak isospin.\n  <li><strong>Pattern recognition:</strong> it highlights the $1\\oplus3$ structure that later scales up to the more intricate block structure of the octonionic action.\n  <li><strong>Continuity:</strong> it shows that the leap to $\\mathbb{O}$ is a continuation of a number-theoretic line, not a wild guess.\n</ol>\n\n<p>After this quaternion warm-up, the following days return to the full octonionic stage, now with a clearer sense of where $SU(2)$ \"comes from\" in the algebraic background.</p>",
  "closing": "Quaternions provide a four-dimensional rehearsal: a rigid $1\\oplus3$ pattern and an $SU(2)$ of unit quaternions that foreshadow the full octonionic stage of one generation.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "H≅ℝ^4; SU(2)⊂Aut(H); W±, Z⁰ aus H-Struktur",
  "dependencies": "Zeigt den Übergang von bekannten (Quaternionen/SU(2)) zu exotischen (Oktonionen/G₂) Strukturen.",
  "isLocked": true,
  "references": [
    {
      "key": "ConwaySmith2003",
      "text": "J. H. Conway and D. A. Smith, On Quaternions and Octonions, A.K. Peters, 2003."
    },
    {
      "key": "Hamilton1844",
      "text": "W. R. Hamilton, ``On quaternions; or on a new system of imaginaries in algebra,'' Philos. Mag. <strong>25</strong>, 489--495 (1844). thebibliography"
    }
  ],
  "intro": "<p>Before we climb to the eight-dimensional octonions, let's pause at a more familiar landmark: the quaternions, denoted $\\mathbb{H}$. If you've studied quantum mechanics or rotations in three dimensions, you've likely encountered them—perhaps as a way to represent rotations without the ambiguities of Euler angles, or as the mathematical home of spin-½ particles.</p>\n\n<p>The quaternions are a four-dimensional number system, built from one real unit and three imaginary units called $\\mathbf{i}$, $\\mathbf{j}$, and $\\mathbf{k}$. They satisfy the famous relations $\\mathbf{i}^2 = \\mathbf{j}^2 = \\mathbf{k}^2 = \\mathbf{ijk} = -1$. Unlike ordinary complex numbers, quaternion multiplication is not commutative: $\\mathbf{ij} \\neq \\mathbf{ji}$.</p>\n\n<p>What makes quaternions interesting for physics is their natural split into a scalar part and a three-dimensional vector part—a $1\\oplus3$ pattern. This is not an arbitrary decomposition; it's built into the algebra itself. The scalar part stays invariant under rotations, while the vector part transforms as a three-component object.</p>\n\n<p>Now here's the key observation: the group of unit quaternions—quaternions with length one—is isomorphic to $SU(2)$, the group of weak isospin in particle physics. In other words, the weak force's internal symmetry is not an abstract label group invented to fit data. It's literally the automorphism group of a four-dimensional number system.</p>\n\n<p>Why does this matter for our octonionic story? Because the step from quaternions to octonions is not a wild leap—it's a natural continuation. The quaternions give us a $1\\oplus3$ structure and an $SU(2)$ symmetry. The octonions give us a richer structure that can host a full generation of internal quantum numbers, with the exceptional group $G_2$ playing the role that $SU(2)$ played for quaternions.</p>\n\n<p>Think of today's sheet as a warm-up exercise: if a four-dimensional number system naturally produces the weak force's $SU(2)$, then an eight-dimensional number system might naturally produce the full internal symmetry structure of the Standard Model. The quaternion day is a bridge between the familiar and the exceptional—a reminder that the idea of \"physics from number systems\" is not as exotic as it first sounds.</p>\n\n<p>Let us see how the quaternion $1\\oplus3$ pattern scales up to the octonionic stage.</p>"
}