{
  "day": 5,
  "date": "2025-12-05",
  "dateDisplay": "December 5, 2025",
  "title": "Radius operator: scales as geometric invariants",
  "subtitle": "From (α,β,γ) to (a₀,b₀,c₀) and energy hierarchies",
  "keyInsight": "The radius operator R extracts three characteristic length scales (a₀,b₀,c₀) from the heptagon structure. Powers of this matrix act as algebraic scale operators whose eigenvalues prototype the Planck, electroweak and QCD scales. Fundamental energy hierarchies emerge as geometric invariants of an internal operator, not as external input parameters.",
  "centralFormula": "R: Spec(R)=(a₀,b₀,c₀); scale operator Σ_N = R^N; Λ_P,Λ_EW,Λ_QCD ∼ a₀^N,b₀^N,c₀^N",
  "type": "Werktag",
  "special": "",
  "dependencies": "First bridge from abstract algebra (H₇, radius operator R) to observable energy scales; uses the heptagon eigenvalues (α,β,γ) from December 4 and prepares the attractor picture (December 7 and 19).",
  "intro": "<p>Yesterday's heptagon operator $H_7$ compressed the seven imaginary directions of the octonions into three eigenvalues $(\\alpha,\\beta,\\gamma)$, capturing angular information about how these directions are oriented relative to each other. Today we take the next step: we pass from angular information to radial information. The <em>radius operator</em> $R$ measures distance in the internal symmetry atlas defined by the heptagon and $G_2$.</p>\n\n<p>We remain in a strict <em>matrix-first</em> viewpoint: all relevant internal quantities are realised as finite $8\\times 8$ matrices on the octonionic space. Numbers such as $(\\alpha,\\beta,\\gamma)$ or $(a_0,b_0,c_0)$ appear only as eigenvalues of these matrices, not as independent scalar fields on top of them.</p>\n\n<p>The radius operator is constructed from the heptagon geometry and the octonionic structure, constrained by $G_2$-invariance and compatibility with the heptagon. Concretely, one can regard $R$ as a matrix polynomial in the heptagon operator,</p>\n<p>\\[ R = c_0\\,\\mathbf{1} + c_1\\,H_7 + c_2\\,H_7^2, \\]</p>\n<p>with real coefficients $c_i$ fixed by these symmetry and compatibility conditions. Since $R$ is a polynomial in $H_7$, the two operators commute and can be diagonalised simultaneously. Its spectrum is again remarkably simple:</p>\n<p>\\[ \\mathrm{spec}(R) = \\{a_0, b_0, c_0\\}, \\]</p>\n<p>three characteristic dimensionless radii with multiplicities adding up to 8. The triple $(a_0,b_0,c_0)$ is the <em>radius spectrum</em>: three internal radii associated with the geometry encoded by the heptagon.</p>",
  "content": "<h3>From directions to radii</h3>\n<p>Yesterday's heptagon operator $H_7$ compressed the seven imaginary directions of the octonions into three eigenvalues $(\\alpha,\\beta,\\gamma)$. Today we take the next step: we pass from <em>angular</em> information to <em>radial</em> information.</p>\n<p>Intuitively:</p>\n<ul>\n  <li>$H_7$ encodes how the seven directions are oriented relative to each other.</li>\n  <li>The radius operator $R$ encodes how far typical internal configurations lie from certain preferred centres in this 7-dimensional structure.</li>\n</ul>\n<p>The precise construction of $R$ is technical, but its qualitative role is simple: it measures distance in the internal symmetry atlas defined by the heptagon and $G_2$.</p>\n\n<h3>Algebraic scale operators: powers of R</h3>\n<p>In quantum field theory, length scales and energy scales are related via multiplicative hierarchies. Analytically, such behaviour is often described by exponential functions. In the octonionic, matrix-based setting used here, we keep everything inside finite matrix algebra and realise the same effect <em>algebraically</em>.</p>\n<p>Instead of forming a matrix exponential $\\exp(R)$, we consider integer powers of the radius operator</p>\n<p>\\[ \\Sigma_N := R^{N}, \\qquad N\\in\\mathbb{N}_{>0}, \\]</p>\n<p>as <em>scale operators</em>. Because $R$ is a finite $8\\times 8$ matrix, all powers $R^N$ are well-defined. By the Cayley–Hamilton theorem, $R$ satisfies its own characteristic polynomial of degree three, so every high power $R^N$ can be written as a quadratic polynomial in $R$:</p>\n<p>\\[ R^{N} = p_0(N)\\,\\mathbf{1} + p_1(N)\\,R + p_2(N)\\,R^2, \\]</p>\n<p>with coefficients $p_i(N)$ depending algebraically on the eigenvalues $a_0,b_0,c_0$.</p>\n<p>In a basis where $R$ is diagonal, it has diagonal entries $a_0,b_0,c_0$ (with their respective multiplicities). Then the powers $R^N$ automatically have diagonal entries</p>\n<p>\\[ a_0^{N},\\quad b_0^{N},\\quad c_0^{N}. \\]</p>\n<p>The action of the scale operator $\\Sigma_N$ on the internal space is thus entirely determined by the <em>powers</em> of the three radii.</p>\n\n<h3>From radii to energy scales</h3>\n<p>We now use these algebraic powers to model physical energy scales. Introduce a single reference unit $\\mu_0$ (for instance in GeV) and define three characteristic energy scales by</p>\n<p>\\[ \\Lambda_{\\mathrm{P}} = \\mu_0\\,a_0^{N},\\qquad \\Lambda_{\\mathrm{EW}} = \\mu_0\\,b_0^{N},\\qquad \\Lambda_{\\mathrm{QCD}} = \\mu_0\\,c_0^{N}, \\]</p>\n<p>for some fixed integer $N$. Only ratios of scales are physically meaningful at this stage, and these ratios are now given by</p>\n<p>\\[ \\frac{\\Lambda_{\\mathrm{P}}}{\\Lambda_{\\mathrm{EW}}} = \\left(\\frac{a_0}{b_0}\\right)^{N}, \\qquad \\frac{\\Lambda_{\\mathrm{EW}}}{\\Lambda_{\\mathrm{QCD}}} = \\left(\\frac{b_0}{c_0}\\right)^{N}. \\]</p>\n<p>Already for moderate integers $N$ (for example $N\\approx 20$–$40$), small algebraic differences between $a_0,b_0,c_0$ can give rise to very large multiplicative separations between the associated scales. This is the discrete, algebraic analogue of an exponential hierarchy—implemented entirely inside the finite matrix algebra of the octonionic model.</p>\n<p>The structural message is:</p>\n<p><em>There exist three distinguished internal radii $(a_0,b_0,c_0)$ and their powers under repeated application of the radius operator generate three physically relevant energy scales.</em></p>\n\n<h3>Why three scales?</h3>\n<p>Empirically, particle physics is organised around three strikingly different characteristic scales:</p>\n<ol>\n  <li>The Planck scale, where gravity becomes comparable to other interactions.</li>\n  <li>The electroweak scale, where $SU(2)_L \\times U(1)_Y$ symmetry is broken.</li>\n  <li>The QCD scale, where confinement and chiral symmetry breaking dominate.</li>\n</ol>\n<p>In the model, this triad is mirrored by the triad $(a_0,b_0,c_0)$:</p>\n<ul>\n  <li>The number of qualitatively distinct scales is fixed by the structure of $R$ and its spectrum, not by phenomenological needs.</li>\n  <li>The relative ordering and separation of these scales can be traced back to ratios such as $a_0/b_0$ and $b_0/c_0$ and to the integer $N$ that counts how often $R$ is applied.</li>\n</ul>\n<p>This turns a long-standing \"why these three?\" question into a statement about the eigenstructure of an internal operator and its algebraic powers.</p>\n\n<h3>Radius operator within the attractor picture</h3>\n<p>On the second Advent Sunday (7 December), the calendar will present the idea of an <em>attractor</em> for scales. In that picture:</p>\n<ul>\n  <li>The triple $(a_0,b_0,c_0)$ defines three preferred radii in the internal space.</li>\n  <li>Renormalisation-group (RG) flow in the physical theory is modelled by repeated application of scale operators built from $R$.</li>\n  <li>The observed scales appear as stable regimes (or fixed points) of this discrete flow rather than arbitrary initial conditions.</li>\n</ul>\n<p>The radius operator $R$ is thus the internal, geometric backbone of this attractor story. Without $R$ and its discrete spectrum, the attractor mechanism would have nothing to lock onto.</p>\n\n<h3>Conceptual gain from $\\mathrm{spec}(R)=(a_0,b_0,c_0)$</h3>\n<p>Introducing $R$ and its spectrum brings several conceptual benefits:</p>\n<ol>\n  <li><strong>Geometric origin of hierarchies:</strong> large ratios between energy scales (Planck vs. electroweak vs. QCD) are no longer mere accidents but are linked to differences between eigenvalues of a symmetry-constrained operator and their algebraic powers.</li>\n  <li><strong>Minimality:</strong> three radii suffice—no large list of independent scale parameters is needed at the fundamental level.</li>\n  <li><strong>Spectral language:</strong> scale information is encoded spectrally, aligning with the later use of spectral geometry and spectral actions.</li>\n</ol>\n<p>This is why we list the radius operator as the first explicit bridge from abstract octonionic geometry to physically observed hierarchies. It turns the question \"Why are there three widely separated scales?\" into \"What is the spectrum of the radius operator, and how do its powers act on the internal space?\"</p>",
  "closing": "The radius operator $R$ translates the heptagon geometry into three characteristic radii $(a_0,b_0,c_0)$. Powers of this matrix provide natural candidates for the Planck, electroweak and QCD scales, turning energy hierarchies into geometric invariants inside a finite octonionic matrix algebra rather than arbitrary external inputs.",
  "isLocked": false,
  "references": [
    {
      "key": "ChamseddineConnesMarcolli2007",
      "text": "A. H. Chamseddine, A. Connes and M. Marcolli, ``Gravity and the standard model with neutrino mixing,'' Adv. Theor. Math. Phys. <strong>11</strong>, 991--1089 (2007)."
    },
    {
      "key": "Wilson1971",
      "text": "K. G. Wilson, ``Renormalization group and critical phenomena,'' Phys. Rev. B <strong>4</strong>, 3174--3183 (1971)."
    }
  ]
}