{
  "day": 10,
  "date": "2025-12-10",
  "dateDisplay": "December 10, 2025",
  "title": "Weinberg angle and couplings from rotor norms",
  "subtitle": "When α, αₛ and  sin²θ_W are geometric overlaps",
  "keyInsight": "The Weinberg angle sin²θ_W≈0.23 describes the mixing of U(1) hypercharge and SU(2) weak isospin. In the octonionic rotor picture, this mixing angle, as well as the electromagnetic and strong couplings, are read off from norms and mutual angles of commutators in an exceptional internal operator space. Electroweak mixing is geometric, not merely phenomenological—the angle is a coordinate on an orbit of the exceptional symmetry, not a dial to be tuned.",
  "intro": "<p>In the usual Standard Model picture, we have a handful of coupling constants that we treat separately: the electromagnetic fine-structure constant α, the strong coupling αₛ, and the Weinberg angle θ_W, which describes how the weak and electromagnetic forces mix in the electroweak transition. All of these are considered running parameters that vary with energy, and whose starting values we take from experiment.</p>\n\n<p>In the octonionic picture, the perspective shifts. Here, these couplings are not simply independent input numbers; they have a common geometric root: they arise from angles and norms of rotor commutators in the internal operator space. In other words, coupling constants measure how strongly certain internal rotations fail to commute with each other.</p>\n\n<p>Think of the internal space as a kind of abstract “rotation space.” For each interaction, we choose specific rotors: one family of rotors for color charge $(SU(3)_C)$, one for the weak isospin directions $(SU(2)_L)$, and a special combination for hypercharge $(U(1)_Y)$.</p>\n\n<p>When two such rotors commute exactly, their interaction with each other is “frictionless”: no coupling arises. As soon as they do not commute, a commutator appears, and its norm measures how strongly these directions “rub” against each other. In this picture, a strong force is simply a large commutator; a weak force is one that nearly vanishes.</p>\n\n<p>The Weinberg angle becomes particularly vivid. In the Standard Model it appears as a mixing angle that combines the gauge fields of SU(2)_L and U(1)_Y to form the photon and the Z boson. In the rotor picture, this angle becomes literally an internal angle between two distinguished rotor directions in operator space: one direction for weak isospin and one for hypercharge. Their inner product defines the angle, and from this angle the familiar relations between couplings follow.</p>\n\n<p>Why is this interesting? Because α, αₛ and sin²θ_W no longer appear as independent random numbers, but as different projections of the same internal geometry. The ratio of their values is fixed by how SU(3)_C × SU(2)_L × U(1)_Y is embedded into the exceptional geometry, not by free choice.</p>\n\n<p>The renormalisation group still ensures that these quantities run with energy. But their common starting point is geometric: it lives in the norms and angles of rotors within a single exceptional-algebra framework.</p>\n\n<p>Today's page invites you to see coupling constants anew: not as arbitrary columns of digits, but as measures of how askew certain internal rotations stand relative to each other.</p>",
  "content": "<h3>Rotor generators for internal forces</h3>\n<p>The internal symmetries of one generation are encoded by\nrotor-like operators $G_a$ acting on the octonionic internal space. In\nthis setting,</p><ul>\n  <li>color $SU(3)_C$ corresponds to one set of rotor directions,</li>\n  <li>weak $SU(2)_L$ to another set,</li>\n  <li>hypercharge $U(1)_Y$ to a particular combination of internal\n        rotations.</li>\n</ul><p>The basic data are the commutators\n\\[\n  [G_a,G_b],\n\\]\nwhose norms and mutual angles in operator space reflect the structure\nconstants and coupling strengths of the effective gauge theory.</p>\n<h3>Couplings as norms in operator space</h3>\n<p>Schematically, one defines an inner product on the space of rotor\noperators, for example via a trace on the internal Hilbert space:\n\\[\n  \\langle A,B\\rangle := \\mathrm{Tr}(A^\\dagger B)\n  \\quad\\text{(up to normalisation).}\n\\]</p><p>With this structure, the effective gauge couplings can be associated with\nthe sizes of commutators:</p><ul>\n  <li>the electromagnetic coupling $\\alpha$ with a suitable abelian\n        combination of rotors,</li>\n  <li>the strong coupling $\\alpha_s$ with the norm of $SU(3)$ commutator\n        directions,</li>\n  <li>the weak coupling $g$ with the norm of $SU(2)$ rotors.</li>\n</ul><p>Symbolically,\n\\[\n  \\alpha \\sim \\|\\,[Q,Q']\\,\\|^2,\\qquad\n  \\alpha_s \\sim \\|[T_a,T_b]\\|^2,\n\\]\nwhere $Q$ is an electromagnetic charge operator and $T_a$ are color\ngenerators. The proportionality constants depend on normalisation\nconventions, but the qualitative statement is: <em>couplings measure\nthe non-commutativity of appropriate rotor directions</em>.</p>\n<h3>Weinberg angle as an internal angle</h3>\n<p>Electroweak unification mixes weak isospin $SU(2)_L$ and hypercharge\n$U(1)_Y$ into the physical photon $A_\\mu$ and $Z_\\mu$ boson. In the\noctonionic rotor picture, this mixing is literally an angle in operator\nspace.</p><p>Let $G_W$ denote the (properly normalised) weak-isospin rotor in the\nrelevant direction and $G_Y$ the hypercharge rotor constructed from the\ninternal algebra. Then one can define an angle $\\theta$ by\n\\[\n  \\cos\\theta =\n  \\frac{\\langle G_W, G_Y\\rangle}\n       {\\|G_W\\|\\,\\|G_Y\\|}.\n\\]</p><p>Up to renormalisation effects, this geometric angle is identified with the\nWeinberg angle $\\theta_W$, and the usual electroweak relations\n\\[\n  e = g\\sin\\theta_W,\\qquad\n  g' = g\\tan\\theta_W\n\\]\nare reinterpreted as relations between norms and inner products of rotor\ndirections.</p>\n<h3>Relations among $\\alpha$, $\\alpha_s$ and $\\sin^2\\theta_W$</h3>\n<p>Because all three quantities are read from the same operator space, they\nare not arbitrary:</p><ul>\n  <li>The relative normalisation of $SU(3)$, $SU(2)$ and $U(1)$ generators\n        is fixed by the representation of the exceptional algebra.</li>\n  <li>This fixes ratios of norms like\n        $\\|T_a\\|^2 : \\|G_W\\|^2 : \\|G_Y\\|^2$.</li>\n  <li>Consequently, at an appropriate reference scale, the couplings\n        are correlated.</li>\n</ul><p>Schematically:\n\\[\n  \\alpha : \\alpha_s : \\frac{1}{\\sin^2\\theta_W}\n  \\;\\sim\\;\n  \\|Q\\|^2 : \\|T_a\\|^2 : \\frac{\\|G_W\\|^2}{\\|G_Y\\|^2},\n\\]\nwith all quantities read from the same operator space. Running with energy\nstill comes from renormalisation-group effects, but the starting values\nare geometrically constrained.</p>\n<h3>What this changes conceptually</h3>\n<p>The Weinberg-angle day is not meant to produce yet another numerical\nprediction, but to change perspective:</p><ol>\n  <li>$\\alpha$, $\\alpha_s$ and $\\sin^2\\theta_W$ are not completely\n        independent parameters, but different projections of the same\n        internal operator geometry.</li>\n  <li>The Weinberg angle becomes what its name suggests:\n        an <em>angle</em> between two distinguished rotor directions.</li>\n  <li>Possible relations among couplings are not coincidences, but\n        fingerprints of how\n        $SU(3)_C\\times SU(2)_L\\times U(1)_Y$ is embedded into the\n        exceptional geometry.</li>\n</ol><p>If later calculations show that the experimentally measured values of\n$\\alpha$, $\\alpha_s$ and $\\sin^2\\theta_W$ can be reconstructed as rotor\nnorms and angles of a concrete octonionic/Albert embedding, that would be\nstrong evidence that “internal geometry” is more than a metaphor.</p>\n\n<p><strong>Weinberg1967</strong><br>\nS.~Weinberg,\n\"A model of leptons,\"\nPhys. Rev. Lett. <strong>19</strong>, 1264--1266 (1967).</p>\n\n<p><strong>Furey2018</strong><br>\nC.~Furey,\n\"$SU(3)_C\\times SU(2)_L \\times U(1)_Y$ from division algebras,\"\nPhys. Lett. B <strong>785</strong>, 84--89 (2018).</p>",
  "closing": "In the rotor picture, couplings and the Weinberg angle are not arbitrary constants but norms and mutual angles of commutators in the exceptional internal operator space.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "sin²θ_W ∼ ||R_Y||² / (||R_Y||² + ||R_W||²)",
  "dependencies": "Shows that electroweak mixing is geometric rather than merely phenomenological: the Weinberg angle becomes an internal angle between rotor directions.",
  "isLocked": true,
  "references": [
    {
      "key": "Weinberg1967",
      "text": "S. Weinberg, ``A model of leptons,'' Phys. Rev. Lett. <strong>19</strong>, 1264--1266 (1967)."
    },
    {
      "key": "Furey2018",
      "text": "C. Furey, ``$SU(3)_C\\times SU(2)_L \\times U(1)_Y$ from division algebras,'' Phys. Lett. B <strong>785</strong>, 84--89 (2018)."
    }
  ]
}