{
  "day": 19,
  "date": "2025-12-19",
  "dateDisplay": "December 19, 2025",
  "title": "Scales as attractor fixed points",
  "subtitle": "From internal eigenvalues to the IR physics of the Standard Model",
  "keyInsight": "Three fundamental scales of the model (M₈, M_C2, M_C1) are not arbitrary fit parameters but eigenvalues of the internal radius operator R. They act as anchors for the renormalisation group (RG) flow. The familiar QCD scale is not a fourth input, but emerges dynamically in the infrared (IR) as the strong coupling runs to confinement.",
  "intro": "<p>Earlier we introduced the radius operator R with its characteristic spectrum (a₀, b₀, c₀). In a purely geometric picture, these are just lengths. In a quantum field theory, they turn into <em>energy scales</em> where the symmetry structure of the model changes.</p><p>We can identify three such scales M₈ ≫ M_C2 ≫ M_C1, which are fixed by the octonionic geometry. They provide the <em>input</em> for the renormalisation group (RG) flow. The physics we observe in the laboratory—including proton mass and confinement—results from running downwards from these seeds into the infrared (IR).</p>",
  "content": "<h3>A four-rung ladder of regimes</h3>\n<p>The three internal scales define only part of the story. The following table summarises how they map onto physical regimes, and how the IR emerges as a fourth stage dynamically.</p>\n\n<table border=\"1\" cellpadding=\"5\" cellspacing=\"0\" style=\"border-collapse:collapse; width:100%;\">\n  <tr>\n    <th style=\"width:30%;\">Scale</th>\n    <th>Physical Role</th>\n  </tr>\n  <tr>\n    <td><strong>TOE</strong><br>M₈ ~ 10¹⁴ GeV</td>\n    <td><strong>Octonionic geometry:</strong> Full Spin(8) and triality active. R and L are defined. Mass operators are universal (M_f ∝ RLR).</td>\n  </tr>\n  <tr>\n    <td><strong>Transition</strong><br>M_C2 ~ 10⁴ GeV</td>\n    <td><strong>Species splitting:</strong> Unified rotor space separates into colour and electroweak blocks. Universal operators project onto Yukawas Y_S.</td>\n  </tr>\n  <tr>\n    <td><strong>EW/Higgs</strong><br>M_C1 ~ 10² GeV</td>\n    <td><strong>Mass generation:</strong> Higgs vev v turns dimensionless Yukawas into real masses (M_f ∝ v Y_S). CKM and PMNS mixing freeze out.</td>\n  </tr>\n  <tr>\n    <td><strong>IR / QCD</strong><br>~ 1 GeV</td>\n    <td><strong>Emergent regime:</strong> RG flow drives the strong coupling to confinement (Λ_QCD). Hadrons form. This scale is <em>dynamic</em>, not geometric.</td>\n  </tr>\n</table>\n\n<p>In words: three geometric seeds generate <em>four</em> dynamical regimes. The IR physics of QCD appears as a consequence of running, not as a new input parameter.</p>\n\n<h3>Why the QCD scale is not an input</h3>\n<p>It is tempting to identify the three internal eigenvalues directly with "Planck, weak and strong" scales. The model suggests a more subtle picture:</p>\n<ul>\n  <li>M₈ is a Planck-like scale of the internal geometry, though numerically below the Planck mass.</li>\n  <li>M_C2 and M_C1 control the splitting into colour and EW, and the emergence of flavour and mixing.</li>\n</ul>\n<p>The QCD scale, Λ_QCD ≈ 200 MeV, is not itself an eigenvalue of R. It appears because the strong coupling, set at M_C2, runs logarithmically: at some IR scale it becomes non-perturbative and the theory confines.</p>\n<p>This is economical: the model uses three geometric inputs to produce four physically relevant regimes. The IR scale is <em>forced</em> by the RG flow.</p>\n\n<h3>Attractors and stability</h3>\n<p>Dynamical systems have <em>attractors</em>: points where flow lines converge. The eigenvalues (a₀, b₀, c₀) play a similar role for the scalar fields and couplings in the octonionic model.</p>\n<ul>\n  <li>They stabilise the vevs of R and L.</li>\n  <li>They tether the RG evolution of the Standard Model parameters.</li>\n</ul>\n<p>Small perturbations at the TOE scale M₈ are washed out by the long running down to the IR. This helps explain why low-energy physics and mass hierarchies look so robust, despite their origin in a high-scale octonionic geometry.</p>",
  "closing": "Three internal scales (M₈, M_C2, M_C1) fix the geometry; the IR world of hadrons and confinement is generated dynamically by RG flow.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "M₈ ≫ M_C2 ≫ M_C1 → Λ_QCD (emergent)",
  "dependencies": "Connects the geometric radius operator with mass definitions (Day 18) and prepares for the shadow sector (Day 20).",
  "isLocked": true,
  "references": [
    {
      "key": "Wilson1971",
      "text": "K. G. Wilson, \"Renormalization group and critical phenomena,\" Phys. Rev. B 4, 3174–3183 (1971)."
    }
  ]
}