{
  "day": 12,
  "date": "2025-12-12",
  "dateDisplay": "December 12, 2025",
  "title": "Three generations from triality",
  "subtitle": "One internal block, three consistent readings",
  "keyInsight": "The octonionic model does not postulate three generations by hand.\n   Instead, it starts from a single eight-dimensional internal block with\n   $\\mathrm{Spin}(8)$ triality. The three triality-related irreducible\n   representations --- vector, left-handed spinor, right-handed spinor ---\n   are read as three coherent ways of organizing the same internal data.\n   When this structure is embedded into the Albert algebra, it naturally\n   unfolds into three fermion generations with correlated mass and mixing\n   patterns.",
  "content": "<h3>Spin(8) and triality</h3>\n<p>The group $\\mathrm{Spin}(8)$, the double cover of $\\mathrm{SO}(8)$, has an\nexceptional property: it possesses three inequivalent eight-dimensional\nirreducible representations,\n\\[\n  V_8,\\qquad S_8^+,\\qquad S_8^-,\n\\]\nusually called the vector, left-handed spinor, and right-handed spinor\nrepresentations. An outer automorphism of $\\mathrm{Spin}(8)$ permutes these\nthree representations. This is the triality symmetry.</p>\n<p>All three irreducible 8-dimensional representations of $\\mathrm{Spin}(8)$\ncan be realised on copies of the octonions $\\mathbb{O}$; what differs\nbetween $V_8$, $S_8^+$ and $S_8^-$ is not the underlying vector space, but\nthe way $\\mathrm{Spin}(8)$ acts on it. This is precisely what makes the\npicture of a single internal eight-dimensional block with three distinct\nreadings natural.</p>\n<p>In abstract group theory, triality is often presented as a curiosity of\nDynkin type $D_4$. In the present model it is taken seriously as structural\ninput:</p>\n<ul>\n  <li>We start from <em>one</em> internal eight-dimensional block, not three\n        unrelated ones.\n  <li>We insist that this block can be read in three coherent ways:\n        as $V_8$, as $S_8^+$, and as $S_8^-$.\n  <li>The consistency of these three readings constrains how internal\n        operators can act.\n</ul>\n<p>This ``one block, three readings'' principle will later be matched to the\nthree observed fermion generations.</p>\n<h3>From octonions to the Albert algebra</h3>\n<p>The internal degrees of freedom of the model are organised using the Albert\nalgebra $H_3(\\mathbb{O})$, the Jordan algebra of $3\\times 3$ hermitian\noctonionic matrices. Its automorphism group is the exceptional Lie group\n$F_4$:\n\\[\n  F_4 \\;=\\; \\mathrm{Aut}\\bigl(H_3(\\mathbb{O})\\bigr).\n\\]</p>\n<p>A convenient picture is to view each diagonal entry as an octonionic\n``slot''. A generic element of $H_3(\\mathbb{O})$ can be written as\n\\[\n  H \\;=\\;\n  \\begin{pmatrix}\n    h_1          & x_{12}      & x_{13} \\\\\n    \\bar{x}_{12} & h_2         & x_{23} \\\\\n    \\bar{x}_{13} & \\bar{x}_{23}& h_3\n  \\end{pmatrix},\n\\]\nwith $h_i\\in\\mathbb{O}$ on the diagonal and $x_{ij}\\in\\mathbb{O}$ off\ndiagonal. In the triality-based reading, the three $h_i$ play asymmetric\nbut tightly related roles: one is assigned a vector structure, the others\ncarry left- and right-handed spinor structures. The three fermion\ngenerations will ultimately be read off from these three correlated\ndiagonal directions.</p>\n<p>Within $H_3(\\mathbb{O})$, this picture can be summarised more schematically:</p>\n<ul>\n  <li>One diagonal octonion slot is associated with the vector\n        representation.\n  <li>The second diagonal slot carries a left-handed spinor structure.\n  <li>The third diagonal slot carries a right-handed spinor structure.\n</ul>\n<p>Triality then manifests itself as a structured permutation of these roles,\nimplemented by elements of $F_4$ that reshuffle the internal directions in a\ncontrolled way.</p>\n<h3>Reading generations from triality sectors</h3>\n<p>When we couple the internal $H_3(\\mathbb{O})$ structure to the spacetime\nDirac operator and the mass map $\\Pi(H)$, each triality sector produces a\nfamily of fermionic modes. Schematically:</p>\n<ul>\n  <li>The <em>vector-like</em> reading of the internal block organises one\n        set of states with a characteristic mass pattern.\n  <li>The <em>left-handed spinor</em> reading gives rise to a second set\n        of states, with masses related but not identical to the first set.\n  <li>The <em>right-handed spinor</em> reading yields a third set, again\n        correlated but distinct.\n</ul>\n<p>These three correlated sets are identified with the three fermion\ngenerations. In this way, the three triality-related sectors can be\nassociated with the observed triplets $(e,\\mu,\\tau)$, $(u,c,t)$ and\n$(d,s,b)$ (and their neutrino partners), not as three unrelated copies,\nbut as three correlated readings of the same internal block. The crucial\npoint is not only that there are exactly three representations, but that\nthey are related by an <em>outer</em> automorphism: they are three faces of\none internal object, not three arbitrary copies.</p>\n<h3>Constraints on mass and mixing patterns</h3>\n<p>Because the three generations arise from a single internal block with\ntriality symmetry, their mass and mixing parameters cannot be chosen\nindependently. Several qualitative features follow:</p>\n<ol>\n  <li><strong>Hierarchy:</strong> The eigenvalues of the mass map $\\Pi(H)$, when\n        restricted to the three triality-related sectors, typically split\n        into bands with a built-in hierarchy. This echoes the observed\n        pattern of light, medium, and heavy generations.\n<p><li><strong>Mixing structure:</strong> The allowed off-diagonal couplings\n        between triality sectors are constrained by the Jordan structure of\n        $H_3(\\mathbb{O})$ and the embedding of the Standard Model gauge\n        group. This shapes the form of the CKM and PMNS matrices.</p>\n<p><li><strong>Stability:</strong> Because the three generations share a common\n        internal origin, small deformations of the vacuum configuration\n        $\\langle H\\rangle$ tend to move all three in a correlated way,\n        rather than producing arbitrary new families.\n</ol></p>\n<p>The goal is not to ``explain every digit'' of the mass spectrum, but to\nshow that three generations with a hierarchical and mixing-rich structure\nare the <em>natural</em> outcome of the exceptional geometry.</p>\n<h3>Comparison with ad hoc family replication</h3>\n<p>In more conventional settings, one starts from a gauge group and then\nadds three copies of the fermion content:\n\\[\n  \\psi \\;\\longrightarrow\\; (\\psi^{(1)},\\psi^{(2)},\\psi^{(3)}),\n\\]\nwith a family index labelling generations. This move works phenomenologically,\nbut it does not tell us why there are three copies, nor why their masses\nare ordered the way we see them.</p>\n<p>The octonionic approach reverses the logic:</p>\n<ul>\n  <li>Start from a single octonionic/Spin(8) block with triality.\n  <li>Embed it into an exceptional algebra ($H_3(\\mathbb{O})$ with $F_4$\n        symmetry).\n  <li>Let the internal mass map and vacuum pick out three correlated\n        triality sectors.\n</ul>\n<p>Family replication is not assumed; it is read off from the structure of\nthe internal algebra.</p>\n<p>\\small\n\\begin{thebibliography}{9}</p>\n<p>\\bibitem{Baez2002}\nJ.~C.~Baez,\n\\newblock ``The octonions,''\n\\newblock {\\em Bull.\\ Amer.\\ Math.\\ Soc.} <strong>39</strong>, 145--205 (2002).</p>\n<p>\\bibitem{GurseyTze1996}\nF.~Gürsey and H.~C.~Tze,\n\\newblock {\\em On the Role of Division, Jordan and Related Algebras in Particle\nPhysics},\n\\newblock World Scientific, 1996.</p>\n<p>\\bibitem{Ramond2010}\nP.~Ramond,\n\\newblock {\\em Group Theory: A Physicist's Survey},\n\\newblock Cambridge University Press, 2010.</p>\n<p>\\end{thebibliography}\n\\normalsize</p>",
  "closing": "Three generations appear as three triality-related faces of a single exceptional internal block, not as three arbitrary copies.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "3 Generationen ↔ (V₈, S₈⁺, S₈⁻)",
  "dependencies": "Erklärt, warum es genau drei Generationen gibt – keine ad-hoc-Annahme.",
  "isLocked": true,
  "references": [
    {
      "key": "Baez2002",
      "text": "J. C. Baez, ``The octonions,'' Bull. Amer. Math. Soc. <strong>39</strong>, 145--205 (2002)."
    },
    {
      "key": "GurseyTze1996",
      "text": "F. Gürsey and H. C. Tze, On the Role of Division, Jordan and Related Algebras in Particle Physics, World Scientific, 1996."
    },
    {
      "key": "Ramond2010",
      "text": "P. Ramond, Group Theory: A Physicist's Survey, Cambridge University Press, 2010. thebibliography"
    }
  ],
  "intro": "<h3>The puzzle of three generations</h3>\n<p>The Standard Model contains three generations of quarks and\nleptons. They have identical gauge quantum numbers but very different masses\nand mixings. From the perspective of the usual gauge-group story this is a\nmystery: why not one generation, or five, or an arbitrary number?</p>\n<p>Most approaches simply accept three generations as an experimental fact and\nadd family indices. The octonionic model takes a different route. It asks\nwhether the number three could arise from the internal representation theory\nof the exceptional structures that underlie the model.</p>\n<p>The key player is the triality of $\\mathrm{Spin}(8)$ and its embedding into\nthe Albert algebra $H_3(\\mathbb{O})$. In the triality picture, the number\nthree is not an adjustable model choice but a built-in feature of\n$\\mathrm{Spin}(8)$: there are exactly three triality-related 8-dimensional\nrepresentations, no more and no fewer.</p>""
}