{
  "day": 13,
  "date": "2025-12-13",
  "dateDisplay": "December 13, 2025",
  "title": "Top quark: heaviest fermion as vacuum anchor",
  "subtitle": "Why $m_t$ ≈ 173 GeV sits next to the electroweak scale",
  "keyInsight": "The top mass $m_t$≈173 GeV lies close to the electroweak scale and acts as the 'anchor' of the vacuum ⟨H⟩. It is the largest eigenvalue of the mass map Π(⟨H⟩). The heaviest fermion is not an outlier but the structural pillar that stabilises the vacuum configuration—without it, the electroweak scale would collapse.",
  "content": "<h3>Masses from the mass map $\\Pi(\\langle H\\rangle)$</h3>\n<p>In the octonionic model, fermion masses are not free\nYukawa coefficients but eigenvalues of a linear map</p><p>\\[\n  \\Pi : $H_3$(\\mathbb{O}) \\longrightarrow \\mathrm{End}(\\mathbb{R}^8),\n\\]</p><p>evaluated at the vacuum configuration $\\langle H\\rangle \\in $H_3$(\\mathbb{O})$.\nThe physical mass matrix is schematically</p><p>\\[\n  M = y\\,\\Pi(\\langle H\\rangle),\n\\]</p><p>with $y$ a universal coupling. Its eigenvalues</p><p>\\[\n  m_i = \\lambda_i\\big(\\Pi(\\langle H\\rangle)\\big)\n\\]</p><p>are the fermion masses. Among these, the largest eigenvalue is identified\nwith the top quark mass $m_t$.</p>\n<h3>The top as the maximal eigenvalue</h3>\n<p>The spectrum of $\\Pi(\\langle H\\rangle)$ is strongly constrained:</p><ul>\n  <li>$\\langle H\\rangle$ is not arbitrary; it minimises a Jordan\n        potential $V_J(H)$ under symmetry constraints.\n  <li>$\\Pi$ respects the $F_4$ symmetry of the Albert algebra.\n  <li>The resulting eigenvalues come in structured patterns rather than\n        random numbers.\n</ul><p>In this setting, the top quark mass appears as</p><p>\\[\n  m_t = \\max \\mathrm{spec}\\big(\\Pi(\\langle H\\rangle)\\big),\n\\]</p><p>the largest eigenvalue in the relevant sector. This is not just a\nnumerical statement; it has a stability interpretation.</p>\n<h3>Vacuum anchoring at the electroweak scale</h3>\n<p>The electroweak scale $Y_S$ is fixed by the minimum of an internal\npotential. Schematically,</p><p>\\[\n  Y_S^2 = -\\frac{\\mu^2}{2(\\lambda+\\kappa c)},\n\\]</p><p>with $\\mu^2,\\lambda,\\kappa,c$ determined by the symmetry atlas. The\nvacuum configuration $\\langle H\\rangle$ sits at this minimum, and\n$\\Pi(\\langle H\\rangle)$ inherits that structure.</p><p>The largest eigenvalue $m_t$ then behaves as an <em>anchor</em>:</p><ul>\n  <li>If $m_t$ were much smaller, the curvature of the potential near\n        the minimum would change, destabilising the electroweak scale.\n  <li>If $m_t$ were much larger, the same structure would shift the\n        position of the minimum, again spoiling the observed scale.\n  <li>The observed value $m_t\\approx 173\\,$GeV lies naturally next to\n        the electroweak scale, reflecting the shared origin in\n        $\\langle H\\rangle$.\n</ul>\n<h3>Top quark versus lighter fermions</h3>\n<p>Lighter fermions (electron, muon, tau; light quarks) correspond to\nsmaller eigenvalues of the same map. Their smallness is explained by the\ngeometry of $\\langle H\\rangle$ in the symmetry atlas:</p><ul>\n  <li>Some directions in $H_3(\\mathbb{O})$ generate large eigenvalues,\n        associated with heavy fermions.\n  <li>Other directions generate exponentially suppressed eigenvalues,\n        associated with light fermions (as discussed for neutrinos on\n        15 December).\n</ul><p>The top quark is simply the fermion whose eigenvector aligns best with\nthe \"steep\" direction of the potential at the vacuum point.</p>\n<h3>Conceptual picture</h3>\n<p>In the usual Standard Model narrative, Yukawa couplings are free\nparameters, and the large top Yukawa is a brute fact. In the octonionic\npicture:</p><ol>\n  <li>The vacuum configuration $\\langle H\\rangle$ is fixed by internal\n    geometry and potential minimisation.\n  <li>The mass operator $\\Pi(\\langle H\\rangle)$ is uniquely determined\n    by this vacuum and the symmetry atlas.\n  <li>The top quark emerges as the strongest-coupled mode to this\n    vacuum, i.e.\\ the maximal eigenvalue.\n</ol><p>The hierarchy \"$m_t$ heavy, others light\" is no longer a collection of\nindependent choices but a single structural statement about one operator\nevaluated at one point in the Albert algebra.</p>",
  "closing": "The top quark is not an accidental heavy outlier. It is the largest\n   eigenvalue of the mass map $\\Pi(\\langle H\\rangle)$ and thus an anchor\n   of the electroweak vacuum. The same internal structure that fixes the\n   electroweak scale also singles out the top as the heaviest fermion.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "m_t = max(eig(Π(⟨H⟩)))",
  "dependencies": "Verbindet die schwerste Fermionmasse direkt mit der Vakuumkonfiguration.",
  "isLocked": true,
  "references": [
    {
      "key": "CDFD02014",
      "text": "CDF and D0 Collaborations, ``Combination of CDF and D0 results on the mass of the top quark,'' Phys. Rev. D <strong>89</strong>, 072001 (2014)."
    },
    {
      "key": "JordanVNW1934",
      "text": "P. Jordan, J. von Neumann and E. Wigner, ``On an algebraic generalization of the quantum mechanical formalism,'' Ann. Math. <strong>35</strong>, 29--64 (1934)."
    }
  ],
  "intro": "<p>In the octonionic model, fermion masses are not free Yukawa coefficients but eigenvalues of a linear map Π(⟨H⟩) evaluated at the vacuum configuration ⟨H⟩ ∈ H₃(𝕆). The physical mass matrix is schematically M = y·Π(⟨H⟩), with y a universal coupling. Its eigenvalues are the fermion masses. Among these, the largest eigenvalue is identified with the top quark mass m_t.</p>\n\n<p>The spectrum of Π(⟨H⟩) is strongly constrained: ⟨H⟩ is not arbitrary; it minimises a Jordan potential V_J(H) under symmetry constraints. Π respects the F₄ symmetry of the Albert algebra. The resulting eigenvalues come in structured patterns rather than random numbers.</p>\n\n<p>In this setting, the top quark mass appears as the largest eigenvalue in the relevant sector. This is not just a numerical statement; it has a stability interpretation.</p>\n\n<p>The electroweak scale Y_S is fixed by the minimum of an internal potential. The vacuum configuration ⟨H⟩ sits at this minimum, and Π(⟨H⟩) inherits that structure. The largest eigenvalue m_t then behaves as an anchor:\n• If m_t were much smaller, the curvature of the potential near the minimum would change, destabilising the electroweak scale.\n• If m_t were much larger, the same structure would shift the position of the minimum, again spoiling the observed scale.\n• The observed value m_t ≈ 173 GeV lies naturally next to the electroweak scale, reflecting the shared origin in ⟨H⟩.</p>\n\n<p>Lighter fermions (electron, muon, tau; light quarks) correspond to smaller eigenvalues of the same map. Their smallness is explained by the geometry of ⟨H⟩ in the symmetry atlas: some directions in H₃(𝕆) generate large eigenvalues, associated with heavy fermions; other directions generate exponentially suppressed eigenvalues, associated with light fermions.</p>\n\n<p>The top quark is simply the fermion whose eigenvector aligns best with the 'steep' direction of the potential at the vacuum point.</p>\n\n<p>In the usual Standard Model narrative, Yukawa couplings are free parameters, and the large top Yukawa is a brute fact. In the octonionic picture:\n1. The vacuum configuration ⟨H⟩ is fixed by internal geometry and potential minimisation.\n2. The mass operator Π(⟨H⟩) is uniquely determined by this vacuum and the symmetry atlas.\n3. The top quark emerges as the strongest-coupled mode to this vacuum, i.e. the maximal eigenvalue.</p>\n\n<p>The hierarchy 'm_t heavy, others light' is no longer a collection of independent choices but a single structural statement about one operator evaluated at one point in the Albert algebra.</p>\n\n<p>The top quark is not an accidental heavy outlier. It is the largest eigenvalue of the mass map Π(⟨H⟩) and thus an anchor of the electroweak vacuum. The same internal structure that fixes the electroweak scale also singles out the top as the heaviest fermion.</p>"
}