{
  "day": 20,
  "date": "2025-12-20",
  "dateDisplay": "December 20, 2025",
  "title": "Dark matter as a shadow sector of compressors",
  "subtitle": "Invisible eigenvalues in an exceptional corner",
  "type": "Werktag",
  "special": "",
  "keyInsight": "If masses and mixings of visible matter arise from the spectra of symmetric compressors derived from a vacuum configuration ⟨H⟩∈H₃(𝕆), it is natural to ask whether the same operator family also generates a dark sector. In the octonionic model, dark matter corresponds to eigenvalues of sterile compressors—modes that couple only gravitationally, because their eigenvectors sit in a corner of the Albert algebra that is decoupled from the rotor network.",
  "centralFormula": "m_vis ~ eig(C_vis), m_DM ~ eig(C_sterile), with [C_sterile, G_a] ≈ 0 for all visible rotors G_a",
  "dependencies": "Builds on the compressor picture of visible matter; connects to mass ladder (Day 19) and prepares for electroweak criticality (Day 21) and observable synthesis (Day 23).",
  "content": "<p>By now, the compressor picture of visible matter is familiar: A vacuum configuration ⟨H⟩ in the Albert algebra H₃(𝕆) defines a mass map (or <em>compressor</em>) Π(⟨H⟩). Its eigenvalues give prototype fermion masses, m<sub>i</sub> ~ eig<sub>i</sub>(Π(⟨H⟩)). Misalignment between different compressors yields flavour mixing (CKM, PMNS).</p><p>The crucial point is that all of this uses the <em>same</em> operator toolbox: symmetric compressors built from ⟨H⟩, living on the same internal octonionic stage that also hosts the rotors encoding gauge forces.</p><p>Astronomy and cosmology, from Zwicky's galaxy clusters to Rubin's rotation curves, tell us that there is about five times more dark matter than ordinary baryons. In the octonionic setting, the most economical question is therefore not \"What exotic field should we add?\", but rather: <em>Which parts of the existing compressor structure remain invisible to rotors and Standard Model charges?</em></p><h3>Bright and shadow directions</h3><p>The Albert algebra H₃(𝕆) is large enough to contain subspaces that do not talk directly to the visible sector. Geometrically, one can distinguish:</p><ul><li><b>Bright directions:</b> eigenvectors that carry nontrivial rotor charges and thus couple to known forces (SU(3)×SU(2)×U(1)).</li><li><b>Shadow directions:</b> eigenvectors that are neutral under all visible rotors, but still present in the compressor spectra.</li></ul><p>Eigenvalues along these shadow directions contribute mass, but not electromagnetic or colour charge. They are prime candidates for a dark sector: massive, gravitating, but invisible in standard detectors.</p><h3>Sterile compressors</h3><p>Formally, a <em>sterile compressor</em> C<sub>sterile</sub> is a symmetric operator on the internal space with the following properties:</p><ul><li>Its eigenvectors are eigenstates of all relevant rotors with <em>trivial</em> eigenvalues (no electric charge, no weak isospin, no colour).</li><li>It appears in the same algebraic representation as the visible compressors C<sub>vis</sub>, but in a different block that does not mix with them at tree level.</li></ul><p>We can symbolically write the mass eigenvalues as m<sub>vis</sub> ~ eig(C<sub>vis</sub>) and m<sub>DM</sub> ~ eig(C<sub>sterile</sub>), with [C<sub>sterile</sub>, G<sub>a</sub>] ≈ 0 for all visible rotors G<sub>a</sub>, while [C<sub>vis</sub>, G<sub>a</sub>] is generically nonzero.</p><p>Such a sterile compressor creates mass without visible force couplings: its eigenmodes are massive but dark. In this sense, dark matter appears as a <em>shadow sector</em> of the same compressor network that organises visible fermion spectra.</p><h3>Mass ranges, stability and structure</h3><p>The octonionic model itself does not yet predict an absolute dark-matter mass scale; that would require a detailed choice of ⟨H⟩ and its embedding in H₃(𝕆). But structurally, it constrains <em>how</em> dark matter can look:</p><ul><li>Dark modes share the same Jordan invariants as visible ones; they are not arbitrary fields but live in the same exceptional algebra.</li><li>Stability is natural: if shadow eigenvectors do not couple to visible rotors, there are no fast decay channels into visible particles.</li><li>Interactions among dark modes can still exist via their own rotor network in the sterile block, potentially leading to self-interacting dark matter scenarios.</li><li>The dark sector should not be a completely flat continuum, but exhibit a discrete spectrum or at least preferred mass scales, echoing the structure of visible masses.</li></ul><p>Cosmologically, such a sector would gravitate like ordinary matter, but be invisible to electromagnetic and strong probes—precisely what astronomical data suggest.</p><h3>Beyond \"add a scalar\"</h3><p>Many dark-matter models add new fields or symmetries by hand. The compressor picture is conceptually different:</p><ul><li>No new algebraic ingredient is introduced beyond the existing exceptional structure.</li><li>Dark matter arises as an <em>unused corner</em> of the same mass map that generates visible fermion spectra.</li><li>The number of dark degrees of freedom, their charges (or lack thereof) and their possible self-interactions are constrained by the representation theory of H₃(𝕆) and F₄.</li></ul><p>In that sense, the model does not explain \"why there is dark matter\" from first principles, but it offers a natural place for it to live—with much less arbitrariness than a generic beyond-the-Standard-Model scenario.</p><p>A compressor-based dark sector also makes expectations that can, in principle, be tested: dark matter should be (to first approximation) gravitational-only with no electric charge; it should show a structured mass pattern rather than a featureless continuum; and it may exhibit self-interactions encoded by a sterile rotor network. If future observations conclusively ruled out any such patterns—e.g. if dark matter were shown to be almost perfectly cold, featureless and non-interacting even with itself—the compressor-shadow picture would lose much of its appeal.</p>",
  "closing": "If masses come from compressors, dark matter is naturally a shadow: eigenvalues of sterile compressors that live in an exceptional corner of the same Albert algebra as visible matter.",
  "isLocked": true,
  "references": [
    {
      "key": "Zwicky1933",
      "author": "F. Zwicky",
      "title": "Die Rotverschiebung von extragalaktischen Nebeln",
      "journal": "Helv. Phys. Acta",
      "volume": "6",
      "pages": "110–127",
      "year": "1933"
    },
    {
      "key": "Rubin1970",
      "author": "V. Rubin and W. K. Ford Jr.",
      "title": "Rotation of the Andromeda nebula from a spectroscopic survey of emission regions",
      "journal": "Astrophys. J.",
      "volume": "159",
      "pages": "379",
      "year": "1970"
    }
  ]
}