{
  "day": 14,
  "date": "2025-12-14",
  "dateDisplay": "December 14, 2025",
  "title": "CKM and PMNS",
  "subtitle": "Mixing matrices as transition charts on H₃(𝕆)",
  "keyInsight": "The mass matrix arises as a linear image of a Jordan element H∈H₃(O) via the map Π:H₃(O)→End(ℝ⁸). Mass spectra depend on Jordan invariants, not on freely chosen parameters. Flavor mixings (CKM, PMNS) result from eigenvectors of specific compressors; mixing angles are constrained by the internal octonionic structure. Mass hierarchies and flavor physics are two faces of the same geometric coin.",
  "content": "<h3>Two mysterious unitary matrices</h3>\n<p>The Standard Model describes quark and lepton mixings by\ntwo unitary matrices:\n\\[\n  V_{\\text{CKM}} \\quad\\text{for quarks},\\qquad\n  U_{\\text{PMNS}} \\quad\\text{for leptons}.\n\\]\nEmpirically, $V_{\\text{CKM}}$ is close to the identity with small off-diagonal\nelements, while $U_{\\text{PMNS}}$ shows large mixings between neutrino\nflavors. In the usual formulation, both matrices are introduced by hand\nwhen diagonalising Yukawa matrices. They are indispensable in\nphenomenology, but their structure appears accidental.</p><p>The octonionic model offers a different viewpoint. It treats mixing angles\nand phases not as arbitrary complex numbers, but as geometric data attached\nto how different preferred bases in the exceptional internal space\nintersect.</p>\n<h3>The internal atlas picture</h3>\n<p>The internal degrees of freedom live in the Albert algebra $H_3(\\mathbb{O})$,\nwith automorphism group $F_4$. On this space, several distinguished\noperators are defined:</p><ul>\n  <li>The <em>mass map</em> $\\Pi(H)$, built from a vacuum configuration\n        $\\langle H\\rangle$, whose eigenvectors encode mass eigenstates.\n  <li><em>Flavor projectors</em> which single out quark-like and\n        lepton-like subspaces.\n  <li><em>Compressor</em> and <em>rotor</em> operators that encode hierarchies\n        and couplings.\n</ul><p>Different physical questions prefer different eigenbases:</p><ul>\n  <li>Gauge interactions \"see\" eigenbases aligned with flavor projectors.\n  <li>Mass measurements \"see\" eigenbases of $\\Pi(H)$.\n</ul><p>The resulting misalignment between these bases is what phenomenologists\ncall \"mixing\". In the geometric language, it is nothing but a transition\nmap between charts on the internal space.</p>\n<h3>CKM as a transition map in the quark sector</h3>\n<p>Focus first on the quark sector. Consider two orthonormal bases of the\nrelevant internal subspace:</p><ul>\n  <li>$\\{\\,|d_i\\rangle\\,\\}$, $i=1,2,3$, adapted to flavor (interaction)\n        eigenstates: these diagonalise the couplings to $W^\\pm$ and gluons.\n  <li>$\\{\\,|d_i'\\rangle\\,\\}$, $i=1,2,3$, adapted to mass eigenstates:\n        these diagonalise the restriction of $\\Pi(H)$ to the down-type quark\n        sector.\n</ul><p>By definition, there exists a unitary matrix $V_{\\text{CKM}}$ such that\n\\[\n  |d_i\\rangle \\;=\\; \\sum_j (V_{\\text{CKM}})_{ij}\\,|d_j'\\rangle.\n\\]\nIn the octonionic setting, both bases arise from eigenproblems for\noperators that live in the same exceptional algebra and are constrained by\nits structure. As a result:</p><ul>\n  <li>The allowed pattern of overlaps $(V_{\\text{CKM}})_{ij}$ is not\n        arbitrary; some entries are naturally suppressed or enhanced.\n  <li>Small quark mixing angles become a consequence of how the quark\n        flavor projectors and the mass map almost commute within the\n        relevant subspace of $H_3(\\mathbb{O})$.\n</ul><p>The hierarchical structure of $V_{\\text{CKM}}$ thus reflects an almost\ncompatible choice of charts in the internal atlas.</p>\n<h3>PMNS and the special role of neutrinos</h3>\n<p>For leptons, the situation is different. The PMNS matrix connects charged\nlepton mass eigenstates to neutrino flavor eigenstates. In many models,\nneutrinos are Majorana particles with a mass matrix that has a different\norigin from the charged lepton masses.</p><p>In the octonionic model, this difference is encoded in the way neutrino\ndirections sit inside $H_3(\\mathbb{O})$:</p><ul>\n  <li>Neutrino-like internal directions may be associated with subspaces\n        that are more strongly affected by nonassociative chains in the\n        octonionic structure.\n  <li>The corresponding projectors onto neutrino subspaces can fail to\n        commute more strongly with the mass map and with certain rotor\n        operators.\n</ul><p>As a result, the overlap matrix $U_{\\text{PMNS}}$ between flavor and mass\neigenbases for leptons can naturally have large off-diagonal entries: the\nrelevant operators pick eigenbases that are more misaligned than in the\nquark case.</p>\n<h3>Qualitative patterns from exceptional constraints</h3>\n<p>The goal of the octonionic approach is not to predict every mixing angle\nand phase numerically from first principles in a single stroke. Instead, it\naims to explain why certain <em>patterns</em> appear robust:</p><ol>\n  <li><strong>Quark mixings are small:</strong> quark flavor projectors and the\n        quark part of $\\Pi(H)$ are nearly simultaneously diagonalisable\n        within the exceptional algebra, leading to small mixing angles.\n  <li><strong>Lepton mixings are large:</strong> leptonic projectors, especially\n        in the neutrino sector, have a more frustrated relation to the mass\n        map and rotor operators, leading to larger natural mixings.\n  <li><strong>Correlations between sectors:</strong> because all these operators\n        live in the same $H_3(\\mathbb{O})$ and share the same vacuum\n        configuration, patterns in the CKM and PMNS matrices are not\n        independent: a change in the internal geometry affects both.\n</ol><p>This is reminiscent of how coordinate changes on a curved manifold cannot\nbe chosen independently in overlapping charts.</p>\n<h3>Towards numerical explorations</h3>\n<p>Once a concrete vacuum configuration $\\langle H\\rangle$ and explicit forms\nfor the mass map, projectors and compressors are chosen, the model becomes\nnumerical:</p><ul>\n  <li>One can diagonalise the relevant operators in $H_3(\\mathbb{O})$ and\n        compute the induced mixing matrices.\n  <li>One can study how these matrices change under deformations of\n        $\\langle H\\rangle$ or of the internal rotor structure.\n  <li>One can search for attractor configurations that yield mixing\n        patterns close to the observed CKM and PMNS matrices.\n</ul><p>In this sense, the exceptional geometry provides a <em>parameter space</em>\nfor mixings that is much more constrained than a generic set of complex\n$3\\times3$ unitary matrices.</p><p><p><strong>Cabibbo1963</strong><br>\nN.~Cabibbo,\n\"Unitary symmetry and leptonic decays,\"\nPhys.\\ Rev.\\ Lett. <strong>10</strong>, 531--533 (1963).</p><p>Kobayashi<p><strong>Maskawa1973</strong><br>\nM.~Kobayashi and T.~Maskawa,\n\"CP violation in the renormalizable theory of weak interaction,\"\nProg.\\ Theor.\\ Phys. <strong>49</strong>, 652--657 (1973).</p><p>MakiNakagawa<p><strong>Sakata1962</strong><br>\nZ.~Maki, M.~Nakagawa and S.~Sakata,\n\"Remarks on the unified model of elementary particles,\"\nProg.\\ Theor.\\ Phys. <strong>28</strong>, 870--880 (1962).</p><p>Gursey<p><strong>Tze1996</strong><br>\nF.~Gürsey and H.~C.~Tze,\nOn the Role of Division, Jordan and Related Algebras in Particle\nPhysics,\nWorld Scientific, 1996.</p>",
  "closing": "CKM and PMNS are read as transition maps between preferred bases in an exceptional internal space, not as arbitrary phenomenological matrices.",
  "type": "Adventssonntag (Doppelblatt)",
  "special": "3. Advent – Doppelblatt",
  "centralFormula": "Π(H)=∑_{i,j} M_{ij}⊗Φ(h_{ij}), M(H)=y Π(H); C v_i = λ_i v_i,  v_i → CKM/PMNS-Spalten",
  "dependencies": "Verankert die Massenhierarchie konkret in der Albert-Algebra und bindet Flavor-Physik direkt an die Struktur der Massenoperatoren.",
  "isLocked": true,
  "references": [
    {
      "key": "Cabibbo1963",
      "text": "N. Cabibbo, ``Unitary symmetry and leptonic decays,'' Phys. Rev. Lett. <strong>10</strong>, 531--533 (1963)."
    },
    {
      "key": "KobayashiMaskawa1973",
      "text": "M. Kobayashi and T. Maskawa, ``CP violation in the renormalizable theory of weak interaction,'' Prog. Theor. Phys. <strong>49</strong>, 652--657 (1973)."
    },
    {
      "key": "MakiNakagawaSakata1962",
      "text": "Z. Maki, M. Nakagawa and S. Sakata, ``Remarks on the unified model of elementary particles,'' Prog. Theor. Phys. <strong>28</strong>, 870--880 (1962)."
    },
    {
      "key": "GurseyTze1996",
      "text": "F. Gürsey and H. C. Tze, On the Role of Division, Jordan and Related Algebras in Particle Physics, World Scientific, 1996. thebibliography"
    }
  ],
  "intro": "<p>The Standard Model describes quark and lepton mixings by two unitary matrices: V_CKM for quarks and U_PMNS for leptons. Empirically, V_CKM is close to the identity with small off-diagonal elements, while U_PMNS shows large mixings between neutrino flavors. In the usual formulation, both matrices are introduced by hand when diagonalising Yukawa matrices. They are indispensable in phenomenology, but their structure appears accidental.</p>\n\n<p>The octonionic model offers a different viewpoint. It treats mixing angles and phases not as arbitrary complex numbers, but as geometric data attached to how different preferred bases in the exceptional internal space intersect.</p>\n\n<p>The internal degrees of freedom live in the Albert algebra H₃(𝕆), with automorphism group F₄. On this space, several distinguished operators are defined: the mass map Π(H), built from a vacuum configuration ⟨H⟩, whose eigenvectors encode mass eigenstates; flavor projectors which single out quark-like and lepton-like subspaces; and compressor and rotor operators that encode hierarchies and couplings.</p>\n\n<p>Different physical questions prefer different eigenbases: gauge interactions 'see' eigenbases aligned with flavor projectors, while mass measurements 'see' eigenbases of Π(H). The resulting misalignment between these bases is what phenomenologists call 'mixing'. In the geometric language, it is nothing but a transition map between charts on the internal space.</p>\n\n<p>Focus first on the quark sector. Consider two orthonormal bases of the relevant internal subspace: {|d_i⟩}, i=1,2,3, adapted to flavor (interaction) eigenstates that diagonalise the couplings to W± and gluons; and {|d_i'⟩}, i=1,2,3, adapted to mass eigenstates that diagonalise the restriction of Π(H) to the down-type quark sector.</p>\n\n<p>By definition, there exists a unitary matrix V_CKM such that |d_i⟩ = Σ_j (V_CKM)_ij |d_j'⟩. In the octonionic setting, both bases arise from eigenproblems for operators that live in the same exceptional algebra and are constrained by its structure. As a result, the allowed pattern of overlaps (V_CKM)_ij is not arbitrary; some entries are naturally suppressed or enhanced. Small quark mixing angles become a consequence of how the quark flavor projectors and the mass map almost commute within the relevant subspace of H₃(𝕆).</p>\n\n<p>The hierarchical structure of V_CKM thus reflects an almost compatible choice of charts in the internal atlas.</p>\n\n<p>For leptons, the situation is different. The PMNS matrix connects charged lepton mass eigenstates to neutrino flavor eigenstates. In many models, neutrinos are Majorana particles with a mass matrix that has a different origin from the charged lepton masses.</p>\n\n<p>In the octonionic model, this difference is encoded in the way neutrino directions sit inside H₃(𝕆): neutrino-like internal directions may be associated with subspaces that are more strongly affected by nonassociative chains in the octonionic structure. The corresponding projectors onto neutrino subspaces can fail to commute more strongly with the mass map and with certain rotor operators.</p>\n\n<p>As a result, the overlap matrix U_PMNS between flavor and mass eigenbases for leptons can naturally have large off-diagonal entries: the relevant operators pick eigenbases that are more misaligned than in the quark case.</p>\n\n<p>The goal of the octonionic approach is not to predict every mixing angle and phase numerically from first principles in a single stroke. Instead, it aims to explain why certain patterns appear robust:\n1. Quark mixings are small: quark flavor projectors and the quark part of Π(H) are nearly simultaneously diagonalisable within the exceptional algebra, leading to small mixing angles.\n2. Lepton mixings are large: leptonic projectors, especially in the neutrino sector, have a more frustrated relation to the mass map and rotor operators, leading to larger natural mixings.\n3. Correlations between sectors: because all these operators live in the same H₃(𝕆) and share the same vacuum configuration, patterns in the CKM and PMNS matrices are not independent: a change in the internal geometry affects both.</p>\n\n<p>This is reminiscent of how coordinate changes on a curved manifold cannot be chosen independently in overlapping charts.</p>\n\n<p>Once a concrete vacuum configuration ⟨H⟩ and explicit forms for the mass map, projectors and compressors are chosen, the model becomes numerical: one can diagonalise the relevant operators in H₃(𝕆) and compute the induced mixing matrices, study how these matrices change under deformations of ⟨H⟩ or of the internal rotor structure, and search for attractor configurations that yield mixing patterns close to the observed CKM and PMNS matrices.</p>\n\n<p>In this sense, the exceptional geometry provides a parameter space for mixings that is much more constrained than a generic set of complex 3×3 unitary matrices.</p>\n\n<p>CKM and PMNS are read as transition maps between preferred bases in an exceptional internal space, not as arbitrary phenomenological matrices.</p>"
}