{
  "day": 15,
  "date": "2025-12-15",
  "dateDisplay": "December 15, 2025",
  "title": "Numerical prototypes (Ersatzbank)",
  "subtitle": "Simple vacua, concrete spectra",
  "keyInsight": "Neutrino masses (∼meV–eV) are not zero but extremely small eigenvalues of a separate compressor C_ν. Their hierarchy follows the same Π-logic as quarks and leptons. Neutrinos have mass because the compressor structure is universal; they are light because their Jordan element H_ν sits in a special corner of the Albert algebra where eigenvalues are exponentially suppressed.",
  "content": "<h3>From symbols to numbers</h3>\n<p>So far, the exceptional structures have been presented in\na largely symbolic way: octonions, the Albert algebra $H_3(\\mathbb{O})$, the\nmass map $\\Pi(H)$ and its relation to vacuum configurations $\\langle H\\rangle$.\nAt some point, however, the model must leave the realm of pure algebra and\nproduce numbers that can be compared, at least qualitatively, to particle\nphysics.</p><p>The good news is that this can already be done with remarkably simple\nchoices of $\\langle H\\rangle$. By freezing most degrees of freedom and\nretaining only a few dominant internal directions, one obtains toy vacua\nthat are simple enough to diagonalise exactly, but rich enough to display\nhierarchical spectra.</p>\n<h3>Diagonal prototype vacua</h3>\n<p>The cleanest starting point is a diagonal configuration in $H_3(\\mathbb{O})$:\n\\[\n  \\langle H\\rangle\n  \\;=\\;\n  \n    \\lambda_1 & 0         & 0 \\\\\n    0         & \\lambda_2 & 0 \\\\\n    0         & 0         & \\lambda_3\n  ,\n  \\qquad\n  \\lambda_i \\in \\mathbb{R}.\n\\]\nSuch a vacuum preserves a maximal amount of internal symmetry: off-diagonal\noctonionic entries are set to zero, and only three real parameters remain.\nDespite this simplicity, the induced mass map\n\\[\n  \\Pi(\\langle H\\rangle) : \\mathcal{H}_{\\text{int}} \\longrightarrow \\mathcal{H}_{\\text{int}}\n\\]\nalready exhibits a nontrivial eigenvalue structure.</p><p>In the eigenvalue problem\n\\[\n  \\Pi(\\langle H\\rangle)\\,\\Psi = m\\,\\Psi,\n\\]\nthe internal Hilbert space $\\mathcal{H}_{\\text{int}}$ decomposes into\nsectors that correspond to quark-like and lepton-like states, coloured and\ncolourless states, left- and right-handed components, and so on. Each\nsector contributes a set of eigenvalues $m$.</p><p>For suitable choices of $(\\lambda_1,\\lambda_2,\\lambda_3)$ one observes:</p><ul>\n  <li>Eigenvalues cluster into a few <em>bands</em>, separated by gaps.\n  <li>Within each band, degeneracies and small splittings appear, induced\n        by the residual internal symmetry.\n  <li>The overall pattern can be read as \"light, medium, heavy\" families,\n        evocative of the observed hierarchy between generations.\n</ul>\n<h3>Off-diagonal perturbations and splitting patterns</h3>\n<p>To go beyond the simplest diagonal picture, one can add controlled\noff-diagonal octonionic entries to $\\langle H\\rangle$:\n\\[\n  \\langle H\\rangle\n  \\;=\\;\n  \n    \\lambda_1 & x         & 0 \\\\\n    \\bar{x}   & \\lambda_2 & y \\\\\n    0         & \\bar{y}   & \\lambda_3\n  ,\n  \\qquad\n  x,y \\in \\mathbb{O}.\n\\]\nEven when $x$ and $y$ are chosen along a single imaginary octonion unit,\nthe eigenvalue structure of $\\Pi(\\langle H\\rangle)$ changes qualitatively:</p><ul>\n  <li>Degenerate bands split into sub-bands.\n  <li>Some states are pushed up or down in mass, mimicking the effect of\n        mixing between different internal directions.\n  <li>Eigenvectors acquire nontrivial support across different\n        triality-related components, foreshadowing the mixing phenomena\n        associated with CKM and PMNS matrices.\n</ul><p>These controlled deformations are the \"numerical workhorses\" of the\nmodel: they allow us to scan how the spectrum responds when the vacuum\nis moved inside $H_3(\\mathbb{O})$.</p>\n<h3>Prototype spectra and their interpretation</h3>\n<p>The resulting eigenvalue sets are not yet to be interpreted as precise\npredictions for Standard Model fermion masses. Instead, they serve as\n<em>prototypes</em> that illustrate what the exceptional machinery tends to\nproduce generically:</p><ol>\n  <li><strong>Banded hierarchies:</strong> eigenvalues group into bands with\n        ratios that are naturally large or small, depending on how many\n        internal directions contribute coherently.\n  <li><strong>Sector-dependent patterns:</strong> quark-like and lepton-like\n        sectors display different splitting patterns, reflecting their\n        different embedding in the internal algebra.\n  <li><strong>Robustness under deformation:</strong> certain qualitative\n        hierarchies persist under a wide range of small changes in\n        $(\\lambda_1,\\lambda_2,\\lambda_3,x,y)$, suggesting that they are\n        structural rather than fine-tuned.\n</ol><p>From this perspective, the complicated observed mass spectrum is seen as\none point in a structured space of possible spectra generated by the\noctonionic geometry.</p>\n<h3>The role of the Ersatzbank</h3>\n<p>Within the larger Advent project, these numerical prototypes form an\n\"Ersatzbank\" of ready-made examples:</p><ul>\n  <li>They can be used to replace more philosophical or qualitative\n        discussion days by concrete numerical sheets.\n  <li>They demonstrate to the reader that the abstract constructions\n        genuinely lead to computable spectra with clear patterns.\n  <li>They provide anchor points for later, more refined fits where\n        the parameters of $\\langle H\\rangle$ and the definition of\n        $\\Pi(H)$ are tuned to approximate real-world data.\n</ul><p>In teaching or outreach contexts, such an Ersatzbank is particularly\nvaluable: it allows one to show explicit tables of ``eigenvalues from an\nexceptional universe'' without requiring the audience to follow every\ntechnical step.</p>\n<h3>An invitation to explore</h3>\n<p>Technically, numerical exploration of $\\Pi(\\langle H\\rangle)$ is\nstraightforward: once a concrete basis for $H_3(\\mathbb{O})$ and the\nrelevant operators is chosen, the problem reduces to diagonalising large\nbut structured matrices. Modern linear algebra libraries can handle this\ncomfortably.</p><p>Conceptually, the challenge is to interpret the resulting patterns in a\nway that respects both the algebraic symmetries and the phenomenological\nconstraints. The prototypes presented here are first steps in that\ndirection: they show that the exceptional machinery is capable of\nproducing spectra that look qualitatively like what one expects from\nquark and lepton masses, without any artificial \"by hand\" hierarchies\ninserted into the Lagrangian.</p><p>Gursey<p><strong>Tze1996</strong><br>\nF.~Gürsey and H.~C.~Tze,\nOn the Role of Division, Jordan and Related Algebras in Particle\nPhysics,\nWorld Scientific, 1996.</p><p><p><strong>Baez2002</strong><br>\nJ.~C.~Baez,\n\"The octonions,\"\nBull.\\ Amer.\\ Math.\\ Soc. <strong>39</strong>, 145--205 (2002).</p><p>Connes<p><strong>Marcolli2008</strong><br>\nA.~Connes and M.~Marcolli,\nNoncommutative Geometry, Quantum Fields and Motives,\nAmerican Mathematical Society, 2008.</p>",
  "closing": "Even very simple vacua in H₃(𝕆) already yield banded, hierarchical spectra: numerical prototypes of a world built from exceptional geometry.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "m_ν ∼ eig(C_ν); C_ν aus Π(H_ν)",
  "dependencies": "Erklärt, warum Neutrinos Masse haben und warum sie so leicht sind.",
  "isLocked": true,
  "references": [
    {
      "key": "GurseyTze1996",
      "text": "F. Gürsey and H. C. Tze, On the Role of Division, Jordan and Related Algebras in Particle Physics, World Scientific, 1996."
    },
    {
      "key": "Baez2002",
      "text": "J. C. Baez, ``The octonions,'' Bull. Amer. Math. Soc. <strong>39</strong>, 145--205 (2002)."
    },
    {
      "key": "ConnesMarcolli2008",
      "text": "A. Connes and M. Marcolli, Noncommutative Geometry, Quantum Fields and Motives, American Mathematical Society, 2008. thebibliography"
    }
  ],
  "intro": "<p>So far, the exceptional structures have been presented in a largely symbolic way: octonions, the Albert algebra H₃(𝕆), the mass map Π(H) and its relation to vacuum configurations ⟨H⟩. At some point, however, the model must leave the realm of pure algebra and produce numbers that can be compared, at least qualitatively, to particle physics.</p>\n\n<p>The good news is that this can already be done with remarkably simple choices of ⟨H⟩. By freezing most degrees of freedom and retaining only a few dominant internal directions, one obtains toy vacua that are simple enough to diagonalise exactly, but rich enough to display hierarchical spectra.</p>\n\n<p>The cleanest starting point is a diagonal configuration in H₃(𝕆): a vacuum with three real parameters λ₁, λ₂, λ₃ on the diagonal and all off-diagonal octonionic entries set to zero. Such a vacuum preserves a maximal amount of internal symmetry. Despite this simplicity, the induced mass map Π(⟨H⟩) already exhibits a nontrivial eigenvalue structure.</p>\n\n<p>In the eigenvalue problem Π(⟨H⟩)Ψ = mΨ, the internal Hilbert space decomposes into sectors that correspond to quark-like and lepton-like states, coloured and colourless states, left- and right-handed components, and so on. Each sector contributes a set of eigenvalues m.</p>\n\n<p>For suitable choices of (λ₁,λ₂,λ₃) one observes: eigenvalues cluster into a few bands, separated by gaps; within each band, degeneracies and small splittings appear, induced by the residual internal symmetry; and the overall pattern can be read as 'light, medium, heavy' families, evocative of the observed hierarchy between generations.</p>\n\n<p>To go beyond the simplest diagonal picture, one can add controlled off-diagonal octonionic entries to ⟨H⟩. Even when these entries are chosen along a single imaginary octonion unit, the eigenvalue structure of Π(⟨H⟩) changes qualitatively: degenerate bands split into sub-bands, some states are pushed up or down in mass, mimicking the effect of mixing between different internal directions, and eigenvectors acquire nontrivial support across different triality-related components, foreshadowing the mixing phenomena associated with CKM and PMNS matrices.</p>\n\n<p>These controlled deformations are the 'numerical workhorses' of the model: they allow us to scan how the spectrum responds when the vacuum is moved inside H₃(𝕆).</p>\n\n<p>The resulting eigenvalue sets are not yet to be interpreted as precise predictions for Standard Model fermion masses. Instead, they serve as prototypes that illustrate what the exceptional machinery tends to produce generically:\n1. Banded hierarchies: eigenvalues group into bands with ratios that are naturally large or small, depending on how many internal directions contribute coherently.\n2. Sector-dependent patterns: quark-like and lepton-like sectors display different splitting patterns, reflecting their different embedding in the internal algebra.\n3. Robustness under deformation: certain qualitative hierarchies persist under a wide range of small changes in the vacuum parameters, suggesting that they are structural rather than fine-tuned.</p>\n\n<p>From this perspective, the complicated observed mass spectrum is seen as one point in a structured space of possible spectra generated by the octonionic geometry.</p>\n\n<p>Within the larger Advent project, these numerical prototypes form an 'Ersatzbank' of ready-made examples: they can be used to replace more philosophical or qualitative discussion days by concrete numerical sheets, they demonstrate to the reader that the abstract constructions genuinely lead to computable spectra with clear patterns, and they provide anchor points for later, more refined fits where the parameters of ⟨H⟩ and the definition of Π(H) are tuned to approximate real-world data.</p>\n\n<p>In teaching or outreach contexts, such an Ersatzbank is particularly valuable: it allows one to show explicit tables of 'eigenvalues from an exceptional universe' without requiring the audience to follow every technical step.</p>\n\n<p>Technically, numerical exploration of Π(⟨H⟩) is straightforward: once a concrete basis for H₃(𝕆) and the relevant operators is chosen, the problem reduces to diagonalising large but structured matrices. Modern linear algebra libraries can handle this comfortably.</p>\n\n<p>Conceptually, the challenge is to interpret the resulting patterns in a way that respects both the algebraic symmetries and the phenomenological constraints. The prototypes presented here are first steps in that direction: they show that the exceptional machinery is capable of producing spectra that look qualitatively like what one expects from quark and lepton masses, without any artificial 'by hand' hierarchies inserted into the Lagrangian.</p>\n\n<p>Even very simple vacua in H₃(𝕆) already yield banded, hierarchical spectra: numerical prototypes of a world built from exceptional geometry.</p>"
}