{
  "day": 20,
  "date": "2025-12-20",
  "dateDisplay": "December 20, 2025",
  "title": "Dark matter as a shadow sector of compressors",
  "subtitle": "Invisible eigenvalues in an exceptional corner",
  "keyInsight": "Dark matter could appear as a 'sterile' sector of the compressors—eigenvalues that couple only gravitationally, not via rotors (forces). This is speculative but structurally plausible: the same operator toolkit that generates visible masses can generate invisible ones, provided they sit in a corner of the Albert algebra that is decoupled from the rotor network.",
  "content": "<h3>Visible matter from compressors</h3>\n<p>By now, the compressor picture of visible matter is\nfamiliar:</p><ul>\n  <li>A vacuum configuration $\\langle H\\rangle$ in the Albert algebra\n        $H_3(\\mathbb{O})$ defines a mass map $\\Pi(\\langle H\\rangle)$.\n  <li>Its eigenvalues give prototype fermion masses,\n        $m_i \\sim \\mathrm{eig}_i\\bigl(\\Pi(\\langle H\\rangle)\\bigr)$.\n  <li>Misalignment between different compressors yields flavour mixing\n        (CKM, PMNS).\n</ul><p>The crucial point is that all of this uses the <em>same</em> operator\ntoolbox: symmetric compressors built from $\\langle H\\rangle$, living on the\nsame internal octonionic stage that also hosts rotors.</p>\n<h3>Where is the dark sector?</h3>\n<p>Astronomy and cosmology tell us that there is about five times more dark\nmatter than ordinary baryonic matter. In the octonionic setting, the most\neconomical question is not \"What exotic field should we add?\", but:</p><p>quote\n  Which parts of the existing compressor structure remain invisible to\n  rotors and Standard-Model charges?\nquote</p><p>The Albert algebra $H_3(\\mathbb{O})$ is large enough to contain subspaces\nthat do not talk directly to the visible sector. Geometrically, one can\ndistinguish:</p><ul>\n  <li><strong>bright directions:</strong> eigenvectors that carry nontrivial\n        rotor charges and thus couple to known forces;\n  <li><strong>shadow directions:</strong> eigenvectors that are neutral under all\n        rotors associated with $SU(3)\\times SU(2)\\times U(1)$, but still\n        present in the compressor spectra.\n</ul><p>Eigenvalues along these shadow directions contribute mass, but not\nelectromagnetic or color charge. They are prime candidates for a dark\nsector.</p>\n<h3>Sterile compressors</h3>\n<p>Formally, a <em>sterile compressor</em> $C_{\\text{sterile}}$ is a symmetric\noperator on the internal space with the following properties:</p><ul>\n  <li>Its eigenvectors are eigenstates of all relevant rotors with\n        <em>trivial</em> eigenvalues (no charge, no weak isospin, no color).\n  <li>It appears in the same algebraic representation as the visible\n        compressors $C_{\\text{vis}}$, but in a different block that does\n        not mix with them at tree level.\n</ul><p>We can symbolically write the mass eigenvalues as\n\\[\n  m_{\\text{DM}} \\;\\sim\\; \\mathrm{eig}\\bigl(C_{\\text{sterile}}\\bigr),\\qquad\n  m_{\\text{vis}} \\;\\sim\\; \\mathrm{eig}\\bigl(C_{\\text{vis}}\\bigr),\n\\]\nwith\n\\[\n  [C_{\\text{sterile}},G_a] \\approx 0\n  \\quad\\text{for all visible rotors }G_a,\n\\]\nwhile $[C_{\\text{vis}},G_a]$ is generically nonzero.</p><p>Such a sterile compressor creates mass without visible force couplings:\nits eigenmodes are massive but dark.</p>\n<h3>Mass ranges and stability</h3>\n<p>The octonionic model itself does not yet predict an absolute dark-matter\nmass scale; that would require a detailed choice of $\\langle H\\rangle$ and\nits embedding in $H_3(\\mathbb{O})$. But structurally, it constrains <em>how</em>\ndark matter can look:</p><ul>\n  <li>Dark modes share the same Jordan invariants as visible ones; they\n        are not arbitrary fields but live in the same exceptional algebra.\n  <li>Stability is natural: if shadow eigenvectors do not couple to\n        rotors, there are no fast decay channels into visible particles.\n  <li>Interactions among dark modes can still exist via their own rotor\n        network in the sterile block, potentially leading to self-interacting\n        dark matter scenarios.\n</ul><p>Cosmologically, such a sector would gravitate like ordinary matter, but be\ninvisible to electromagnetic and strong probes—precisely what astronomical\ndata suggest.</p>\n<h3>Why this is not just \"add a scalar\"</h3>\n<p>Many dark-matter models add new fields or symmetries by hand. The\ncompressor picture is conceptually different:</p><ul>\n  <li>No new algebraic ingredient is introduced beyond the existing\n        exceptional structure.\n  <li>Dark matter arises as an <em>unused corner</em> of the same mass map\n        that generates visible fermion spectra.\n  <li>The number of dark degrees of freedom, their charges (or lack\n        thereof) and their possible self-interactions are constrained by\n        the representation theory of $H_3(\\mathbb{O})$ and $F_4$.\n</ul><p>In that sense, the model does not explain \"why there is dark matter\" from\nfirst principles, but it offers a natural place for it to live—with much\nless arbitrariness than a generic beyond-the-Standard-Model scenario.</p>\n<h3>What could falsify this picture?</h3>\n<p>A compressor-based dark sector makes several expectations that can, in\nprinciple, be tested:</p><ul>\n  <li><strong>Gravitational only (to first approximation):</strong>\n        direct electromagnetic signatures (e.g.\\ electric charge of dark\n        matter) should be absent or extremely suppressed.\n  <li><strong>Structured mass spectrum:</strong>\n        the dark sector should not be a completely flat continuum, but\n        exhibit a discrete spectrum or at least preferred mass scales,\n        echoing the structure of visible masses.\n  <li><strong>Possible self-interactions:</strong>\n        the same formalism that builds rotors for the visible sector can\n        build a sterile rotor network; this opens the door to dark\n        self-interaction signals (e.g.\\ in halo shapes or cluster mergers).\n</ul><p>If future observations conclusively ruled out any such patterns—e.g.\\ if\ndark matter were shown to be almost featureless, perfectly cold and\nnon-interacting even with itself—the compressor-shadow picture would lose\nmuch of its appeal.</p>\n<h3>A structural, not final, proposal</h3>\n<p>This Advent sheet is deliberately cautious:</p><ul>\n  <li>It does not claim to have <em>the</em> dark-matter candidate, with a\n        precise mass and cross section ready for exclusion plots.\n  <li>It does claim that, once you take the octonionic/Albert structure\n        seriously, a dark sector is almost unavoidable: there are simply\n        too many directions that do not couple to visible rotors.\n</ul><p>Dark matter thus appears less as an alien addition and more as a\nstructural shadow of the same exceptional geometry that organises quarks\nand leptons. The same operator toolbox—rotors and compressors on\n$H_3(\\mathbb{O})$—carries both visible and dark sectors; the difference\nlies in which eigenvectors we are able to illuminate.</p><p><p><strong>Zwicky1933</strong><br>\nF.~Zwicky,\n\"Die Rotverschiebung von extragalaktischen Nebeln,\"\nHelv.\\ Phys.\\ Acta <strong>6</strong>, 110–127 (1933).</p><p><p><strong>Rubin1970</strong><br>\nV.~Rubin and W.~K.~Ford Jr.,\n``Rotation of the Andromeda nebula from a spectroscopic survey of\nemission regions,''\nAstrophys.\\ J. <strong>159</strong>, 379 (1970).</p><p>Chap14\n[Internal notes on compressor sectors and dark modes, see chap14\\_neu.tex;\nchap20\\_neu.tex.]</p>",
  "closing": "If masses come from compressors, dark matter is naturally a shadow:\n   eigenvalues of sterile compressors that live in an exceptional corner\n   of the same Albert algebra as visible matter.",
  "type": "Werktag",
  "special": "",
  "centralFormula": "m_DM ∼ eig(C_steril); keine Rotor-Kopplung",
  "dependencies": "Spekulativer, aber strukturell plausibler Kandidat für Dunkle Materie.",
  "isLocked": true,
  "references": [
    {
      "key": "Zwicky1933",
      "text": "F. Zwicky, ``Die Rotverschiebung von extragalaktischen Nebeln,'' Helv. Phys. Acta <strong>6</strong>, 110–127 (1933)."
    },
    {
      "key": "Rubin1970",
      "text": "V. Rubin and W. K. Ford Jr., ``Rotation of the Andromeda nebula from a spectroscopic survey of emission regions,'' Astrophys. J. <strong>159</strong>, 379 (1970)."
    },
    {
      "key": "Chap14",
      "text": "[Internal notes on compressor sectors and dark modes, see chap14_neu.tex; chap20_neu.tex.] thebibliography"
    }
  ],
  "intro": "<p>If masses and mixings of visible matter arise from the spectra of symmetric compressors derived from ⟨H⟩∈H₃(𝕆), it is natural to ask whether the same operator family could also generate a dark sector. The octonionic model suggests a speculative but structurally simple answer: dark matter corresponds to eigenvalues of sterile compressors—modes that couple only gravitationally, because their eigenvectors sit in a corner of the Albert algebra that is decoupled from the rotor network.</p>\n\n<p>By now, the compressor picture of visible matter is familiar: a vacuum configuration ⟨H⟩ in the Albert algebra H₃(𝕆) defines a mass map Π(⟨H⟩). Its eigenvalues give prototype fermion masses, mᵢ ~ eigᵢ(Π(⟨H⟩)). Misalignment between different compressors yields flavour mixing (CKM, PMNS).</p>\n\n<p>The crucial point is that all of this uses the same operator toolbox: symmetric compressors built from ⟨H⟩, living on the same internal octonionic stage that also hosts rotors.</p>\n\n<p>Astronomy and cosmology tell us that there is about five times more dark matter than ordinary baryonic matter. In the octonionic setting, the most economical question is not 'What exotic field should we add?', but: Which parts of the existing compressor structure remain invisible to rotors and Standard-Model charges?</p>\n\n<p>The Albert algebra H₃(𝕆) is large enough to contain subspaces that do not talk directly to the visible sector. Geometrically, one can distinguish:\n• bright directions: eigenvectors that carry nontrivial rotor charges and thus couple to known forces;\n• shadow directions: eigenvectors that are neutral under all rotors associated with SU(3)×SU(2)×U(1), but still present in the compressor spectra.</p>\n\n<p>Eigenvalues along these shadow directions contribute mass, but not electromagnetic or color charge. They are prime candidates for a dark sector.</p>\n\n<p>Formally, a sterile compressor C_sterile is a symmetric operator on the internal space with the following properties: its eigenvectors are eigenstates of all relevant rotors with trivial eigenvalues (no charge, no weak isospin, no color), and it appears in the same algebraic representation as the visible compressors C_vis, but in a different block that does not mix with them at tree level.</p>\n\n<p>We can symbolically write the mass eigenvalues as</p>\n\n<p>m_DM ~ eig(C_sterile), m_vis ~ eig(C_vis),</p>\n\n<p>with</p>\n\n<p>[C_sterile,G_a] ≈ 0 for all visible rotors G_a,</p>\n\n<p>while [C_vis,G_a] is generically nonzero.</p>\n\n<p>Such a sterile compressor creates mass without visible force couplings: its eigenmodes are massive but dark.</p>\n\n<p>The octonionic model itself does not yet predict an absolute dark-matter mass scale; that would require a detailed choice of ⟨H⟩ and its embedding in H₃(𝕆). But structurally, it constrains how dark matter can look: dark modes share the same Jordan invariants as visible ones; they are not arbitrary fields but live in the same exceptional algebra. Stability is natural: if shadow eigenvectors do not couple to rotors, there are no fast decay channels into visible particles. Interactions among dark modes can still exist via their own rotor network in the sterile block, potentially leading to self-interacting dark matter scenarios.</p>\n\n<p>Cosmologically, such a sector would gravitate like ordinary matter, but be invisible to electromagnetic and strong probes—precisely what astronomical data suggest.</p>\n\n<p>Many dark-matter models add new fields or symmetries by hand. The compressor picture is conceptually different: no new algebraic ingredient is introduced beyond the existing exceptional structure. Dark matter arises as an unused corner of the same mass map that generates visible fermion spectra. The number of dark degrees of freedom, their charges (or lack thereof) and their possible self-interactions are constrained by the representation theory of H₃(𝕆) and F₄.</p>\n\n<p>In that sense, the model does not explain 'why there is dark matter' from first principles, but it offers a natural place for it to live—with much less arbitrariness than a generic beyond-the-Standard-Model scenario.</p>\n\n<p>A compressor-based dark sector makes several expectations that can, in principle, be tested: gravitational only (to first approximation)—direct electromagnetic signatures (e.g. electric charge of dark matter) should be absent or extremely suppressed; structured mass spectrum—the dark sector should not be a completely flat continuum, but exhibit a discrete spectrum or at least preferred mass scales, echoing the structure of visible masses; and possible self-interactions—the same formalism that builds rotors for the visible sector can build a sterile rotor network; this opens the door to dark self-interaction signals (e.g. in halo shapes or cluster mergers).</p>\n\n<p>If future observations conclusively ruled out any such patterns—e.g. if dark matter were shown to be almost featureless, perfectly cold and non-interacting even with itself—the compressor-shadow picture would lose much of its appeal.</p>\n\n<p>This Advent sheet is deliberately cautious: it does not claim to have the dark-matter candidate, with a precise mass and cross section ready for exclusion plots. It does claim that, once you take the octonionic/Albert structure seriously, a dark sector is almost unavoidable: there are simply too many directions that do not couple to visible rotors.</p>\n\n<p>Dark matter thus appears less as an alien addition and more as a structural shadow of the same exceptional geometry that organises quarks and leptons. The same operator toolbox—rotors and compressors on H₃(𝕆)—carries both visible and dark sectors; the difference lies in which eigenvectors we are able to illuminate.</p>"
}